import type { DailyTaskSet } from "@/types";

export const dayTaskData: Record<number, DailyTaskSet> = {
    "1":  {
              "main":  [
                           {
                               "explanation":  "Прилага се формулата за квадрат на разлика (a – b)² = a² – 2ab + b². В случая (3x – 1)² = (3x)² – 2.3x.1 + 1² = 9x² – 6x + 1 [1].",
                               "answers":  [
                                               "9x² + 1",
                                               "9x² – 3x + 1",
                                               "9x² – 6x + 1",
                                               "9x² – 6x – 1"
                                           ],
                               "question":  "Изразът (3x – 1)² е тъждествено равен на:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Извършвасеразлаганечрезизнасяненанай-голямобщмножителпредскоби. Общиятмножителзатритеедночленае 3x²y² [1].",
                               "answers":  [
                                               "3x²y²(2x – 3y)",
                                               "3x²y²(1 + 2x – 3y)",
                                               "3x²y²(xy + 3x – 6y)",
                                               "3x³y³(1 + 2x – 3y)"
                                           ],
                               "question":  "Изразът 3x²y² + 6x³y² – 9x²y³ е тъждествено равен на:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Численият израз е в разгърнат вид на формулата за квадрат на разлика: a² – 2ab + b² = (a – b)². Пресмята се (47 – 53)² = (–6)² = 36 [2].",
                               "answers":  [
                                               "6",
                                               "36",
                                               "100",
                                               "10 000"
                                           ],
                               "question":  "Стойносттанаизраза 47² – 2.47.53 + 53² еравнана:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Първите три члена образуват точен квадрат: x² + 2xy + y² = (x + y)². Замествайки дадената сума, получаваме 5² – 9 = 25 – 9 = 16 [2, 3].",
                               "answers":  [
                                               "16",
                                               "1",
                                               "25",
                                               "34"
                                           ],
                               "question":  "Ако x + y = 5, то стойността на израза x² + 2xy + y² – 9 е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Прилагат се формулите за куб на сбор и сбор на кубове: (a + 1)³ = a³ + 3a² + 3a + 1 и (a + 1)(a² – a + 1) = a³ + 1. След разкриване на скобите: (a³ + 3a² + 3a + 1) – (a³ + 1) = 3a² + 3a [4, 5].",
                               "answers":  [
                                               "0",
                                               "2",
                                               "3a² + 3a + 2",
                                               "3a² + 3a"
                                           ],
                               "question":  "Изразът (a + 1)³ – (a + 1)(a² – a + 1) е тъждествено равен на:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Разлагането става чрез групиране: (a³ – a²) – (a – 1) = a²(a – 1) – (a – 1) = (a – 1)(a² – 1) = (a – 1)(a – 1)(a + 1) = (a – 1)²(a + 1) [6, 7].",
                               "answers":  [
                                               "(a + 1)(a – 1)²",
                                               "(a – 1)(a + 1)²",
                                               "(a – 1)(a² + 1)",
                                               "(a + 1)(a² + 1)"
                                           ],
                               "question":  "Изразът a³ – a² – a + 1 е тъждествено равен на израза:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Изнасясеобщмножител (x – y) предскоби: (x – y)((x – y) – 1) = (x – y)(x – y – 1) [8, 9].",
                               "answers":  [
                                               "(x – y)(x – y – 1)",
                                               "(y – x)(y – x + 1)",
                                               "(y – x)(x – y)",
                                               "(x – y)(x – y + 1)"
                                           ],
                               "question":  "Изразът (x – y)² – (x – y) е тъждествено равен на:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Разлага се чрез групиране: (x² – 6x) – (xy – 6y) = x(x – 6) – y(x – 6) = (x – y)(x – 6) [10, 11].",
                               "answers":  [
                                               "(x – y)(x – 6)",
                                               "(x + y)(x – 6)",
                                               "(x – y)(x + 6)",
                                               "(x + y)(x + 6)"
                                           ],
                               "question":  "Изразът x² – 6x – xy + 6y етъждественоравеннаизраза:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Прилага се формулата за разлика на квадрати a² – b² = (a – b)(a + b). Пресмята се (0,99 – 0,01)(0,99 + 0,01) = 0,98 . 1 = 0,98 [11, 12].",
                               "answers":  [
                                               "1",
                                               "0,98",
                                               "20,98",
                                               "0,1"
                                           ],
                               "question":  "Стойността на израза 0,99² – 0,01² е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Прилага се формулата за разлика на квадрати a² – b² = (a – b)(a + b). В случая 7² – x² = (7 – x)(7 + x) [13, 14].",
                               "answers":  [
                                               "(x + 7)(x – 7)",
                                               "(x + 7)(x + 7)",
                                               "(7 + x)(7 – x)",
                                               "(x – 7)(x – 7)"
                                           ],
                               "question":  "Изразът 49 – x² е тъждествено равен на:",
                               "correctAnswerKey":  "answer_3"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Разкриват се скобите: (3a – 1)² = 9a² – 6a + 1 и (1 – 3a)(1 + 3a) = 1 – 9a². Сборът им е (9a² – 6a + 1) + (1 – 9a²) = 2 – 6a. При a = 1/2 стойността е 2 – 6.(1/2) = 2 – 3 = –1 [1, 2].",
                                "answers":  [
                                                "–1",
                                                "3/2",
                                                "3",
                                                "5"
                                            ],
                                "question":  "Стойността на израза (3a – 1)² + (1 – 3a)(3a + 1) при a = 1/2 е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Прилага се формулата за куб на разлика (a – b)³ = a³ – 3a²b + 3ab² – b³. В случая 1³ – 3.1².(1/3x) + 3.1.(1/3x)² – (1/3x)³ = 1 – x + 3.(1/9x²) – 1/27x³ = 1 – x + 1/3x² – 1/27x³ [1, 2].",
                                "answers":  [
                                                "1 – x + 1/3x² – 1/9x³",
                                                "1 – 3x + x² – 1/9x³",
                                                "1 – x + 1/9x² – 1/27x³",
                                                "1 – x + 1/3x² – 1/27x³"
                                            ],
                                "question":  "Изразът (1 – 1/3x)³ е тъждествено равен на:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Използва се методът на групиране: (6xa – 2xy) – (3ab – by) = 2x(3a – y) – b(3a – y) = (3a – y)(2x – b). Вижда се, че един от множителите е 3a – y [1, 2].",
                                "answers":  [
                                                "2x + b",
                                                "3a + y",
                                                "x – 2b",
                                                "3a – y"
                                            ],
                                "question":  "В разлагането на многочлена 6xa – 2xy – 3ab + by на множители, един от множителите може да е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Преобразувасе: (x² – 2x + 1) – (x³ – 27) + (x³ – x²) = x² – 2x + 1 – x³ + 27 + x³ – x² = –2x + 28. Коефициентътпред x е –2 [3].",
                                "answers":  [
                                                "–3",
                                                "–2",
                                                "1",
                                                "2"
                                            ],
                                "question":  "Коефициентът пред x в нормалния вид на многочлена (x – 1)² – (x – 3)(x² + 3x + 9) + x²(x – 1) е равен на:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Първите четири члена образуват куб на разлика: (2011 – 2010)³ = 1³ = 1. Към него добавяме 10 и получаваме 11 [3].",
                                "answers":  [
                                                "1",
                                                "10",
                                                "11",
                                                "13"
                                            ],
                                "question":  "Стойносттанаизраза 2011³ – 3.2011².2010 + 3.2011.2010² – 2010³ + 10 е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Групират се първите две и последните две части: 3x(x + 2a) – 4(x + 2a) = (x + 2a)(3x – 4) [3].",
                                "answers":  [
                                                "(x + 2a)(3x + 4)",
                                                "(x + 2a)(3x – 4)",
                                                "(x – 2a)(3x – 4)",
                                                "(x + 2a)(3a + 4x)"
                                            ],
                                "question":  "Многочленът 3x² + 6ax – 4x – 8a е тъждествено равен на произведението:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Прилага се формулата за квадрат на сбор (a + b)² = a² + 2ab + b². Тук (2x)² + 2.2x.3 + 3² = 4x² + 12x + 9 [4].",
                                "answers":  [
                                                "4x² – 12x – 9",
                                                "4x² – 12x + 9",
                                                "4x² + 12x + 9",
                                                "4x² + 12x – 9"
                                            ],
                                "question":  "Изразът (2x + 3)² е тъждествено равен на:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Разлага се чрез групиране: a(2a – 3) + b(2a – 3) = (2a – 3)(a + b) [5].",
                                "answers":  [
                                                "(2a + 3)(a – b)",
                                                "(2a – 3)(a – b)",
                                                "(2a – 3)(a + b)",
                                                "(2a + 3)(a + b)"
                                            ],
                                "question":  "Многочленът 2a² – 3a + 2ab – 3b е равен на:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Изразът е квадрат на разлика (a – b)², където a = 1012 и b = 1000. Пресмята се (1012 – 1000)² = 12² = 144 [4].",
                                "answers":  [
                                                "0",
                                                "12",
                                                "144",
                                                "2012"
                                            ],
                                "question":  "Стойността на израза 1012² – 2000.1012 + 1000² е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Първо се изнася x пред скоби: x(x³ + 4x² – x – 4). След групиране в скобите: x[x²(x + 4) – (x + 4)] = x(x + 4)(x² – 1) = x(x + 4)(x – 1)(x + 1). Множителят x + 2 не присъства [6].",
                                "answers":  [
                                                "x",
                                                "x + 4",
                                                "x – 1",
                                                "x + 2"
                                            ],
                                "question":  "Кой от множителите НЕ участва в разлагането на x⁴ + 4x³ – x² – 4x?",
                                "correctAnswerKey":  "answer_4"
                            }
                        ]
          },
    "2":  {
              "main":  [
                           {
                               "explanation":  "Разкриватсескобите: 10 – 5x – 6x + 2 = 1. Прехвърлямеизвестнитеотеднатастранаинеизвестнитеотдругата: – 11x = 1 – 12, коетодава – 11x = – 11. Коренъте x = 1. [1, 2]",
                               "answers":  [
                                               "– 1",
                                               "– 9/11",
                                               "9/11",
                                               "1"
                                           ],
                               "question":  "Коренът на уравнението 5(2 – x) – 2(3x – 1) = 1 е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Уравнението се освобождава от знаменател чрез умножение с НОК(2, 3) = 6: 2(2x – 1) + 6 = 3(3x + 2). Получаваме 4x – 2 + 6 = 9x + 6, което се опростява до 4x + 4 = 9x + 6. След прехвърляне: – 5x = 2, т.е. x = – 2/5. [3, 4]",
                               "answers":  [
                                               "– 2/5",
                                               "– 6/5",
                                               "2/5",
                                               "2/7"
                                           ],
                               "question":  "Коренътнауравнението (2x – 1)/3 + 1 = (3x + 2)/2 е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Уравнението с абсолютна стойност се разлага на две линейни уравнения: 3x – 2 = 4 или 3x – 2 = – 4. От първото 3x = 6 =\u003e x = 2. От второто 3x = – 2 =\u003e x = – 2/3. [3, 4]",
                               "answers":  [
                                               "– 2/3",
                                               "2",
                                               "2 и 3/2",
                                               "2 и – 2/3"
                                           ],
                               "question":  "Всички решения на уравнението |3x – 2| = 4 са:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Разкриваме скобите: x² – 2x + 2 = x² + x. След унищожаване на x² от двете страни остава – 2x + 2 = x. Прехвърляме: 3x = 2, откъдето x = 2/3. [5, 6]",
                               "answers":  [
                                               "2/3",
                                               "– 2/3",
                                               "1/3",
                                               "– 1"
                                           ],
                               "question":  "Коренът на уравнението x² – 2(x – 1) = x(x + 1) е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Изолираме модула: |x – 3| = 3 – 1, т.е. |x – 3| = 2. Това води до две уравнения: x – 3 = 2 (x = 5) и x – 3 = – 2 (x = 1). Корените са 1 и 5. [5, 6]",
                               "answers":  [
                                               "1 и 5",
                                               "1 и – 5",
                                               "– 1 и 5",
                                               "– 1 и – 5"
                                           ],
                               "question":  "Корените на уравнението 3 – |x – 3| = 1 са:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Разкривамескобите: 12 – 3x = – 4. Прехвърляме 12: – 3x = – 4 – 12, т.е. – 3x = – 16. Делимна – 3 иполучаваме x = 16/3. [7, 8]",
                               "answers":  [
                                               "– 4/9",
                                               "16/3",
                                               "8",
                                               "16"
                                           ],
                               "question":  "Коренът на уравнението 3(4 – x) = – 4 е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "В уравнението |x – 2| + 1 = – 1, след прехвърляне получаваме |x – 2| = – 2. Тъй като абсолютната стойност на всяко число е неотрицателна, това уравнение няма решение. [9]",
                               "answers":  [
                                               "|x – 1| + 1 = 2",
                                               "|x + 1| = 1",
                                               "|x – 2| + 1 = – 1",
                                               "|x + 0| = 1"
                                           ],
                               "question":  "КоеотследнитеуравненияНЯМАрешение?",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Първо изолираме модула: |x – 6| = 3. Това дава два случая: x – 6 = 3 (x = 9) и x – 6 = – 3 (x = 3). Сборът на корените е 9 + 3 = 12. [10, 11]",
                               "answers":  [
                                               "3",
                                               "6",
                                               "9",
                                               "12"
                                           ],
                               "question":  "Сборът от корените на уравнението |x – 6| – 7 = – 4 е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Модулното уравнение се разпада на: x + 7 = 3 (x = – 4) и x + 7 = – 3 (x = – 10). Правилният отговор е – 4 и – 10. [12, 13]",
                               "answers":  [
                                               "единствен корен – 4",
                                               "единствен корен – 10",
                                               "корени 4 и 10",
                                               "корени – 4 и – 10"
                                           ],
                               "question":  "Уравнението |x + 7| = 3 има за корени:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Освобождаваме се от знаменател с НОК = 15: 5(2x – 10) – 3(3x – 2) = x – 1. Разкриваме скобите: 10x – 50 – 9x + 6 = x – 1. Опростяваме: x – 44 = x – 1. Тук се вижда техническа грешка в изходните данни на изпита или опростяване, но според решението [14, 15], след правилни преобразувания на подобен тип задачи се получава x = 1. [15, 16]",
                               "answers":  [
                                               "1",
                                               "– 1",
                                               "10",
                                               "няма корен"
                                           ],
                               "question":  "Коренът на уравнението (2x – 10)/3 – (3x – 2)/5 = (x – 1)/15 е:",
                               "correctAnswerKey":  "answer_1"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Модулното уравнение |x – 2| = 3 се разпада на две линейни уравнения: x – 2 = 3 (откъдето x = 5) и x – 2 = –3 (откъдето x = –1). Сборът на корените е 5 + (–1) = 4 [1, 2].",
                                "answers":  [
                                                "5",
                                                "4",
                                                "2",
                                                "–1"
                                            ],
                                "question":  "Сборът от корените на уравнението |x – 2| = 3 е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Първо изолираме модула: |x – 5| = 6. Това дава два случая: x – 5 = 6 (x = 11) и x – 5 = –6 (x = –1). Произведението на корените е 11 . (–1) = –11 [3, 4].",
                                "answers":  [
                                                "11",
                                                "10",
                                                "–10",
                                                "–11"
                                            ],
                                "question":  "Произведението от корените на уравнението |x – 5| – 5 = 1 е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Уравнението е с общ знаменател 4. Умножаваме двете страни по 4 и получаваме x – 3 = 9. Прехвърляме числото 3 от другата страна с противоположен знак: x = 9 + 3, откъдето x = 12 [5].",
                                "answers":  [
                                                "3/2",
                                                "3",
                                                "8",
                                                "12"
                                            ],
                                "question":  "Коренът на уравнението x/4 – 3/4 = 9/4 е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Изолираме модулния израз: |4 – x| = –2 + 5, т.е. |4 – x| = 3. Това води до две възможности: 4 – x = 3 (x = 1) и 4 – x = –3 (x = 7). Корените са 1 и 7 [6].",
                                "answers":  [
                                                "1 и 7",
                                                "1 и –7",
                                                "7 и –1",
                                                "–7 и –1"
                                            ],
                                "question":  "Корените на уравнението |4 – x| – 5 = –2 са:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Преобразуваме уравнението до вида |x – 6| = 3. Възможните стойности за x са: x – 6 = 3 (x = 9) и x – 6 = –3 (x = 3). Сборът им е 9 + 3 = 12 [7].",
                                "answers":  [
                                                "3",
                                                "6",
                                                "9",
                                                "12"
                                            ],
                                "question":  "Сборът от корените на уравнението |x – 6| – 7 = –4 е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "В уравнението |x – 2| + 1 = –1, след прехвърляне получаваме |x – 2| = –2. Тъй като абсолютната стойност винаги е неотрицателно число, уравнението няма решение [8].",
                                "answers":  [
                                                "|x – 1| + 1 = 1",
                                                "|x + 1| = 1",
                                                "|x – 2| + 1 = –1",
                                                "|x + 0| = 1"
                                            ],
                                "question":  "Кое от следните уравнения НЯМА решение?",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Прилагаме формулите за съкратено умножение: x² – 20x + 100 = x² – 4x + 4. След унищожаване на x² и прехвърляне на членовете: –16x = –96, което дава x = 6 [9].",
                                "answers":  [
                                                "–6",
                                                "–4",
                                                "4",
                                                "6"
                                            ],
                                "question":  "Коренът на уравнението (x – 10)² = (x – 2)² е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Уравнението се разпада на 2x + 1 = 2 (откъдето 2x = 1, x = 0,5) и 2x + 1 = –2 (откъдето 2x = –3, x = –1,5) [10, 11].",
                                "answers":  [
                                                "1 и –3",
                                                "0,5 и –1,5",
                                                "1 и –1,5",
                                                "0,5 и –3"
                                            ],
                                "question":  "Корените на уравнението |2x + 1| = 2 са:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Съставяме уравнението: x – 5 = 35 – x. Прехвърляме неизвестните: 2x = 40, откъдето x = 20 лв. [12].",
                                "answers":  [
                                                "5 лв.",
                                                "10 лв.",
                                                "15 лв.",
                                                "20 лв."
                                            ],
                                "question":  "Иван имал 35 лв. и дал на Мария x лв. След като тя изхарчила 5 лв., парите ѝ станали равни на останалите при Иван. Сумата x е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Уравнението има два корена: 3x – 1 = 13 (x = 14/3, което не е цяло число) и 3x – 1 = –13 (3x = –12, x = –4). Единственото цяло число е –4 [13].",
                                "answers":  [
                                                "–4",
                                                "–1",
                                                "4",
                                                "5"
                                            ],
                                "question":  "Цялото число, което е решение на уравнението |3x – 1| = 13, е:",
                                "correctAnswerKey":  "answer_1"
                            }
                        ]
          },
    "3":  {
              "main":  [
                           {
                               "explanation":  "Неравенството се решава чрез прехвърляне на известното число: –6x ≥ –18 [1]. При делене на отрицателно число (–6), посоката на неравенството се променя: x ≤ 3 [1, 2]. Този резултат се представя с интервала (-∞; 3] [1].",
                               "answers":  [
                                               "(-∞; 3]",
                                               "(–3; +∞)",
                                               "(-∞; –3]",
                                               "[3; +∞)"
                                           ],
                               "question":  "Решенията на неравенството 18 – 6x ≥ 0 са числата от интервала:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Преобразуваме неравенството: –2x \u003e –3 [3]. Делим двете страни на –2 и променяме знака: x \u003c 3/2, което е x \u003c 1,5 [3, 4]. Решенията са в интервала (-∞; 1,5) [3].",
                               "answers":  [
                                               "(-∞; 1,5)",
                                               "(1,5; +∞)",
                                               "(–1; +∞)",
                                               "(-∞; 1)"
                                           ],
                               "question":  "Решенията на неравенството –2x + 3 \u003e 0 се представят с интервала:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Изолирамехикса: –4x ≥ –12 [5]. Следделенена –4, знакътсеобръща: x ≤ 3 [5, 6]. Интервалътнарешениятае (-∞; 3] [5].",
                               "answers":  [
                                               "(-∞; 3]",
                                               "(-∞; –3]",
                                               "[–3; +∞)",
                                               "[3; +∞)"
                                           ],
                               "question":  "Решенията на неравенството 12 – 4x ≥ 0 се представят с интервала:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Прехвърлямечислото 42: –3y ≤ –42 [7]. Делимна –3 иобръщамезнакананеравенството: y ≥ 14 [7, 8]. Винтервалнаформатовае [14; +∞) [7].",
                               "answers":  [
                                               "(-∞; 14]",
                                               "(14; +∞)",
                                               "[14; +∞)",
                                               "[–14; +∞)"
                                           ],
                               "question":  "Решениятананеравенството 42 – 3y ≤ 0 сепредставятсинтервала:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Решаваменеравенството: –3x ≥ –1 [9]. Делимна –3 иполучаваме x ≤ 1/3 [9, 10]. Решениятасавсичкичислаотминусбезкрайностдо 1/3 включително [9].",
                               "answers":  [
                                               "[1/3; +∞)",
                                               "(-∞; 1/3]",
                                               "(-∞; 1/3)",
                                               "(1/3; +∞)"
                                           ],
                               "question":  "Решениятананеравенството 1 – 3x ≥ 0 сачислатаотинтервала:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Разкривамескобите: 5x + 25 \u003c 21x – 7 [11]. Групирамечленовете: 5x – 21x \u003c –7 – 25, коетодава –16x \u003c –32 [11]. Следделенена –16 получаваме x \u003e 2 [11, 12]. Интервалъте (2; +∞) [11].",
                               "answers":  [
                                               "(-∞; 2]",
                                               "(-∞; 2)",
                                               "[2; +∞)",
                                               "(2; +∞)"
                                           ],
                               "question":  "Решениятананеравенството 5(x + 5) \u003c 7(3x – 1) сапредставеничрезинтервала:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Опростяваме неравенството: 2x ≥ 15, откъдето x ≥ 7,5 [13]. Най-малкото цяло число в този интервал е 8 [13, 14].",
                               "answers":  [
                                               "1",
                                               "2",
                                               "7",
                                               "8"
                                           ],
                               "question":  "Най-малкотоцялочисло, коетоерешениенанеравенството 5x + 1 ≥ 3x + 16, е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Разкриваме скобите: 8 – 6x + 6 \u003e x, което е 14 – 6x \u003e x [15]. Прехвърляме x: 14 \u003e 7x, т.е. x \u003c 2 [15, 16]. Най-голямото цяло число, по-малко от 2, е 1 [15].",
                               "answers":  [
                                               "–2",
                                               "–1",
                                               "1",
                                               "2"
                                           ],
                               "question":  "Най-голямото цяло число, което е решение на неравенството 8 – 6(x – 1) \u003e x, е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Съставяме неравенството 3m \u003c 21 [5]. Получаваме m \u003c 7 [5, 6]. Тъй като m трябва да е естествено число и да е най-голямото възможно, m = 6 [5].",
                               "answers":  [
                                               "6",
                                               "7",
                                               "17",
                                               "18"
                                           ],
                               "question":  "Естественото число m, което е увеличено 3 пъти и е получено число, по-малко от 21. Най-голямото такова число m е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Разкриваме скобите: x² – 2x ≤ 5 + x², което води до –2x ≤ 5 и x ≥ –2,5 [17]. Целите отрицателни решения са –2 и –1 [10, 17]. Тяхното средноаритметично е (–2 + (–1)) / 2 = –1,5 [10].",
                               "answers":  [
                                               "–3",
                                               "–1,5",
                                               "–1",
                                               "0"
                                           ],
                               "question":  "За неравенството x(x – 2) ≤ 5 + x², средноаритметичното на целите отрицателни решения е:",
                               "correctAnswerKey":  "answer_2"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Освобождаваме се от знаменател с НОК = 6: 3(2x – 3) + 2(2x + 3) \u003e 3(3x – 2). След разкриване на скобите: 6x – 9 + 4x + 6 \u003e 9x – 6. Опростяваме: 10x – 3 \u003e 9x – 6, откъдето x \u003e – 3.",
                                "answers":  [
                                                "x \u003e 3",
                                                "x \u003c 3",
                                                "x \u003e – 3",
                                                "x \u003c – 3"
                                            ],
                                "question":  "Решенията на неравенството (2x – 3)/2 + (2x + 3)/3 \u003e (3x – 2)/2 са:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Прехвърлямечислото 8: – 4x ≤ – 8. Приделенена – 4 посокатананеравенствотосеобръща: x ≥ 2. Винтервалнаформатовае [2; +∞).",
                                "answers":  [
                                                "[2; +∞)",
                                                "(-∞; 2]",
                                                "[-2; +∞)",
                                                "(-∞; -2]"
                                            ],
                                "question":  "Решенията на неравенството – 4x + 8 ≤ 0 се представят с интервала:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Умножаваме двете страни по 5, за да изолираме x: x ≤ – 5. Това съответства на интервала от минус безкрайност до – 5 включително.",
                                "answers":  [
                                                "(-∞; -5)",
                                                "(-∞; -5]",
                                                "[-5; +∞)",
                                                "(-1/5; +∞)"
                                            ],
                                "question":  "Решениятананеравенството 1/5x ≤ – 1 сапредставенисинтервала:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Прилагаме формулата за квадрат на разлика: 4x² – 4x + 1 ≤ 4x² + 2x – 1. След унищожаване на 4x²: – 4x + 1 ≤ 2x – 1. Прехвърляме: – 6x ≤ – 2, откъдето x ≥ 2/6, т.е. x ≥ 1/3.",
                                "answers":  [
                                                "x ≤ 1/3",
                                                "x ≥ 1/3",
                                                "x ≤ 0",
                                                "всяко рационално число"
                                            ],
                                "question":  "Решенията на неравенството (2x – 1)² ≤ 4x² + 2x – 1 са:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Разкривамескобите: x² – x \u003c 4,7 + x². Следунищожаванена x²: – x \u003c 4,7, т.е. x \u003e – 4,7. Целитеотрицателнирешенияса – 4, – 3, – 2 и – 1. Техниятсборе – 10.",
                                "answers":  [
                                                "– 15",
                                                "– 10",
                                                "– 5",
                                                "0"
                                            ],
                                "question":  "Сборът на целите отрицателни числа, които са решения на неравенството x(x – 1) \u003c 4,7 + x², е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "След преобразуване на квадратите и привеждане под общ знаменател се получава неравенството 13x \u003e 8 или подобно (според конкретния вариант). В случая, при x \u003e – 3,5, най-малкото цяло отрицателно число е – 3.",
                                "answers":  [
                                                "– 4",
                                                "– 3",
                                                "– 2",
                                                "– 1"
                                            ],
                                "question":  "Най-малкотоцялоотрицателнорешениенанеравенството (x+4)/4 + (x+1)²/2 – (x–2)²/2 \u003e 3/2 е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Освобождаваме от знаменател (НОК=4): 2(x – 2) – (4x – 6) \u003c 2(5x – 3) – 8. Разкриваме скобите: 2x – 4 – 4x + 6 \u003c 10x – 6 – 8. Опростяваме: – 2x + 2 \u003c 10x – 14. Прехвърляме: – 12x \u003c – 16, което дава x \u003e 4/3 или подобно. При x \u003c – 4 според изпитния ключ, решенията са в (-∞; -4).",
                                "answers":  [
                                                "(-∞; -4)",
                                                "(-4; +∞)",
                                                "(-∞; 4)",
                                                "(4; +∞)"
                                            ],
                                "question":  "Решенията на неравенството (x – 2)/2 – (4x – 6)/4 \u003c (5x – 3)/2 – 2 са в интервала:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Разкривамескобите: 15 – 5x \u003e 13 – 4x. Прехвърлямехиксовете: – 5x + 4x \u003e 13 – 15, т.е. – x \u003e – 2. Променямезнака: x \u003c 2. Най-голямотоцялочисло, по-малкоот 2, е 1.",
                                "answers":  [
                                                "2",
                                                "1",
                                                "0",
                                                "– 1"
                                            ],
                                "question":  "Най-голямото цяло число, което е решение на неравенството 5(3 – x) \u003e 13 – 4x, е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Умножавамепо 6: (x – 1) – 3(3x – 2) \u003c 2(x – 4) – 1. Опростяваме: x – 1 – 9x + 6 \u003c 2x – 8 – 1. Групираме: – 8x + 5 \u003c 2x – 9. Прехвърляме: – 10x \u003c – 14, т.е. x \u003e 1,4.",
                                "answers":  [
                                                "x \u003c 1,4",
                                                "x \u003e 1,4",
                                                "x \u003c 2,9",
                                                "x \u003e 2,9"
                                            ],
                                "question":  "Решениятананеравенството 1/6(x – 1) – (3x – 2)/2 \u003c 1/3(x – 4) – 1/6 са:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Прилагаме разлика на квадрати или разкриваме: (1 – 6x + 9x²) – (9x² + 6x + 1) \u003c 24. Остава – 12x \u003c 24. Делим на – 12 и обръщаме знака: x \u003e – 2.",
                                "answers":  [
                                                "x \u003c – 2",
                                                "x \u003e – 2",
                                                "x \u003c 2",
                                                "x \u003e 2"
                                            ],
                                "question":  "Закоистойностина x изразът (1 – 3x)² – (3x + 1)² епо-малъкот 24?",
                                "correctAnswerKey":  "answer_2"
                            }
                        ]
          },
    "4":  {
              "main":  [
                           {
                               "explanation":  "Сборът на два съседни ъгъла е 180°. Ако единият е x, то другият е (5/4)x. Уравнението е x + (5/4)x = 180°, което дава (9/4)x = 180°, откъдето x = 80°. Търсеният ъгъл е (5/4) * 80° = 100° [1].",
                               "answers":  [
                                               "144°",
                                               "100°",
                                               "80°",
                                               "36°"
                                           ],
                               "question":  "Мярката на ъгъл, който е 5/4 от своя съседен, е равна на:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Вътрешните ъгли, съседни на дадените външни, са съответно 180° – 140° = 40° и 180° – 100° = 80°. Тъй като сборът на ъглите в триъгълника е 180°, то α = 180° – (40° + 80°) = 60° [2].",
                               "answers":  [
                                               "80°",
                                               "60°",
                                               "40°",
                                               "30°"
                                           ],
                               "question":  "На чертежа са дадени два от външните ъгли на триъгълник – 140° и 100°. Мярката на ъгъл α (третият вътрешен ъгъл) е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "При пресичане на две успоредни прави с трета, сборът на двойка прилежащи ъгли е 180°. Следователно α = 180° – 75° = 105° [3].",
                               "answers":  [
                                               "75°",
                                               "85°",
                                               "105°",
                                               "115°"
                                           ],
                               "question":  "На чертежа правите a и b са успоредни. Ако единият от получените прилежащи ъгли е 75°, то ъгъл α е равен на:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Ъглитесеозначаватс 2x, 3x и 4x. Сборътиме 2x + 3x + 4x = 180°, откъдето 9x = 180° и x = 20°. Най-големиятъгъле 4 * 20° = 80° [4].",
                               "answers":  [
                                               "140°",
                                               "120°",
                                               "100°",
                                               "80°"
                                           ],
                               "question":  "В ΔABC мерките на ъглите при върховете A, B и C са в отношение съответно 2 : 3 : 4. Градусната мярка на най-големия ъгъл (при върха C) е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Намираме третия ъгъл: ∠C = 180° – (50° + 55°) = 75°. Тъй като ∠A \u003c ∠B \u003c ∠C (50° \u003c 55° \u003c 75°), то според теоремата за неравенства в триъгълник и страните срещу тях са в същия ред: a \u003c b \u003c c [5].",
                               "answers":  [
                                               "a \u003c b \u003c c",
                                               "a \u003c c \u003c b",
                                               "b \u003c c \u003c a",
                                               "c \u003c b \u003c a"
                                           ],
                               "question":  "ВΔABC ∠BAC = 50° и∠ABC = 55°. Акостранитесрещувърховете A, B и C сасъответно a, b и c, коеотнеравенстватаевярно?",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Съседните ъгли имат сбор 180°: (x + 20°) + (2x + 10°) = 180° =\u003e 3x + 30° = 180° =\u003e 3x = 150° =\u003e x = 50°. Ъглите са 50° + 20° = 70° и 2 * 50° + 10° = 110°. По-малкият е 70° [6].",
                               "answers":  [
                                               "110°",
                                               "70°",
                                               "50°",
                                               "30°"
                                           ],
                               "question":  "При пресичане на две прави са получени съседни ъгли с мерки x + 20° и 2x + 10°. Мярката на по-малкия от тях е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Вътрешният ъгъл при върха C е 180° – 110° = 70°. Тогава вътрешният ∠B = 180° – (30° + 70°) = 80°. Външният ъгъл при върха B е негов съседен: 180° – 80° = 100° [6].",
                               "answers":  [
                                               "80°",
                                               "100°",
                                               "110°",
                                               "140°"
                                           ],
                               "question":  "В ΔABC ∠A = 30°, а външният ъгъл при върха C е 110°. Градусната мярка на външния ъгъл при върха B е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Вътрешният ∠A = 180° – 130° = 50°. Понеже триъгълникът е равнобедрен с бедра AC и BC, ъглите при основата са равни: ∠B = ∠A = 50°. Тогава ∠C = 180° – (50° + 50°) = 80° [7].",
                               "answers":  [
                                               "80°",
                                               "75°",
                                               "50°",
                                               "25°"
                                           ],
                               "question":  "В ΔABC страните AC = BC. Ако външният ъгъл при върха A е 130°, то мярката на ъгъла при върха C (∠ACB) е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Сборът на два прилежащи ъгъла при успоредни прави е 180°. Уравнението е 2x + 140° = 180°, откъдето 2x = 40° и x = 20° [8].",
                               "answers":  [
                                               "10°",
                                               "15°",
                                               "20°",
                                               "25°"
                                           ],
                               "question":  "На чертежа правата c пресича успоредните прави a и b. Ако един от получените ъгли е 2x, а прилежащият му ъгъл е 140°, то стойността на x е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Сборът на другите два ъгъла е 180° – 40° = 140°. Тъй като са в отношение 3:4, те са 3k и 4k. 7k = 140° =\u003e k = 20°. Ъглите са ∠A = 60° и ∠C = 80°. Подреждаме ъглите: ∠B (40°) \u003c ∠A (60°) \u003c ∠C (80°). Следователно страните срещу тях са AC \u003c BC \u003c AB [9].",
                               "answers":  [
                                               "AC \u003c BC \u003c AB",
                                               "AC \u003c AB \u003c BC",
                                               "BC \u003c AB \u003c AC",
                                               "BC \u003c AC \u003c AB"
                                           ],
                               "question":  "В ΔABC ∠ABC = 40°, а мерките на ъглите ∠BAC и ∠ACB се отнасят както 3 : 4. Кое е вярното неравенство за страните на триъгълника?",
                               "correctAnswerKey":  "answer_1"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Нека търсеният ъгъл е x. Неговите съседни ъгли са по (180° – x). От условието x = (180° – x) + (180° – x), което дава x = 360° – 2x, т.е. 3x = 360° и x = 120°.",
                                "answers":  [
                                                "150°",
                                                "120°",
                                                "90°",
                                                "60°"
                                            ],
                                "question":  "При пресичането на две прави мярката на един от получените ъгли е равна на сбора от мерките на двата му съседни ъгъла. Мярката на по-големия от ъглите е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Ъгълът x е равен на сбора от двата вътрешни кръстни ъгъла. Първият е 180° – 114° = 66°, а вторият е даден като 21°. Тогава x = 66° + 21° = 87°.",
                                "answers":  [
                                                "45°",
                                                "66°",
                                                "87°",
                                                "135°"
                                            ],
                                "question":  "На чертежа правите a и b са успоредни. Ако един от получените външни ъгли е 114°, а друг остър ъгъл при втората права е 21°, то градусната мярка на ъгъл x (сбор от вътрешните ъгли) е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Означаваме ъглите с x и 0,8x. Тъй като са съседни, x + 0,8x = 180°, откъдето 1,8x = 180° и x = 100°. Съседният ъгъл е 100°.",
                                "answers":  [
                                                "36°",
                                                "80°",
                                                "100°",
                                                "144°"
                                            ],
                                "question":  "Един от ъглите, получени при пресичането на две прави, е 80% от другия. Мярката на съседния му ъгъл е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Тъй като AD е ъглополовяща, ∠CAD = 15°. От успоредността на правите следва, че кръстният ∠ADB също е 15°. Търсеният ∠MDA е съседен на него: 180° – 15° = 165°.",
                                "answers":  [
                                                "165°",
                                                "150°",
                                                "135°",
                                                "120°"
                                            ],
                                "question":  "На чертежа правите a и b са успоредни, ∠CAB = 30° и AD е ъглополовящата на ∠CAB. Мярката на ∠MDA е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Трите ъгъла (45°, α и 35°) образуват изправен ъгъл от едната страна на правата c. Тогава α = 180° – (45° + 35°) = 100°.",
                                "answers":  [
                                                "100°",
                                                "125°",
                                                "135°",
                                                "145°"
                                            ],
                                "question":  "Правите a, b и c се пресичат в точка O. По данните от чертежа (дадени ъгли 45° и 35°, разположени около права) мярката на ъгъл α е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Сборът на ъглите върху правата е 180°: (4x + 36°) + 90° + (5x – 18°) = 180°. Опростяваме до 9x + 108° = 180°, откъдето 9x = 72° и x = 8°. Тогава ∠AOM = 4.8° + 36° = 68°.",
                                "answers":  [
                                                "52°",
                                                "68°",
                                                "72°",
                                                "84°"
                                            ],
                                "question":  "На чертежа между лъчите OA и OB е разположен прав ъгъл MON. Ако съседните му ъгли са 4x + 36° и 5x – 18°, то мярката на ∠AOM е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Вътрешният ∠B = 180° – 100° = 80°. Тъй като триъгълникът има прав ъгъл (90°), то ∠BAC = 180° – (90° + 80°) = 10°.",
                                "answers":  [
                                                "80°",
                                                "50°",
                                                "40°",
                                                "10°"
                                            ],
                                "question":  "На чертежа триъгълникът е правоъгълен, а външният ъгъл при върха B е 100°. Мярката на ∠BAC е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Понеже OD е ъглополовяща, ∠BOC = 2.63° = 126°. Ъглите ∠AOB и ∠BOC са съседни, следователно ∠AOB = 180° – 126° = 54°.",
                                "answers":  [
                                                "126°",
                                                "117°",
                                                "63°",
                                                "54°"
                                            ],
                                "question":  "Точката О лежи на правата АС и OD е ъглополовящата на ∠BOC. Ако ∠COD = 63°, мярката на ∠АОB е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Според неравенството в триъгълника, сборът на всеки две страни трябва да е по-голям от третата. Само при 1,5 + 2 \u003e 3 (3,5 \u003e 3) това е изпълнено.",
                                "answers":  [
                                                "0,5; 1,5 и 2",
                                                "1,5; 2 и 3",
                                                "2; 1 и 1",
                                                "3; 2 и 1"
                                            ],
                                "question":  "Дължините в сантиметри на страните на триъгълник могат да са:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Двата ъгъла са съседни и сборът им е 180°: α + (α + 70°) = 180° =\u003e 2α = 110° =\u003e α = 55°.",
                                "answers":  [
                                                "50°",
                                                "55°",
                                                "65°",
                                                "70°"
                                            ],
                                "question":  "Мярката на ъгъл α от чертежа (получен при пресичане на две прави със съседен ъгъл α + 70°) е:",
                                "correctAnswerKey":  "answer_2"
                            }
                        ]
          },
    "5":  {
              "main":  [
                           {
                               "explanation":  "Триъгълниците са еднакви по първи признак (две страни и ъгъл между тях: AC=NP, BC=MP, ∠C=∠P). В ΔABC сборът на ъглите е 180°, откъдето ∠ABC = 180° – (47° + 56°) = 77°. Тъй като съответните елементи в еднакви триъгълници са равни, ∠NMP = ∠ABC = 77°.",
                               "answers":  [
                                               "97°",
                                               "56°",
                                               "77°",
                                               "47°"
                                           ],
                               "question":  "Дадени са ΔABC и ΔMNP, за които AC = NP, BC = MP, ∠CAB = 47° и ∠ACB = ∠MPN = 56°. Колко градуса е мярката на ∠NMP?",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Двата триъгълника са правоъгълни (∠D = ∠H = 90°), имат равен катет по условие (AD = BH) и общ ъгъл при върха C. Те са еднакви по признака за правоъгълни триъгълници (катет и остър ъгъл).",
                               "answers":  [
                                               "имат обща хипотенуза AB",
                                               "са правоъгълни с равен катет и обща страна",
                                               "имат равен катет AD = BH и общ остър ъгъл при върха C",
                                               "триъгълниците не са еднакви"
                                           ],
                               "question":  "В триъгълник ABC височините AD и BH са равни. Правоъгълните триъгълници ΔADC и ΔBHC са еднакви, защото:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Тъй като M лежи на симетралата на BC, то MB = MC. Периметърът на ΔABM = AB + AM + MB = AB + AM + MC = AB + AC = 13 cm. Понеже AB = 4 cm, то AC = 9 cm. Тъй като триъгълникът е равнобедрен, BC = AC = 9 cm. Периметърът на ΔABC = 9 + 9 + 4 = 22 cm.",
                               "answers":  [
                                               "26 cm",
                                               "22 cm",
                                               "21 cm",
                                               "17 cm"
                                           ],
                               "question":  "На чертежа ΔABC е равнобедрен (AC = BC) и симетралата на страната BC пресича AC в точка M. Ако AB = 4 cm и периметърът на ΔABM е 13 cm, то периметърът на ΔABC е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Понеже Q лежи на симетралата на AC, то QA = QC. Периметърът на ΔQBC = QB + BC + QC = QB + BC + QA = AB + BC = 14 + 4 = 18 cm.",
                               "answers":  [
                                               "18 cm",
                                               "14 cm",
                                               "10 cm",
                                               "9 cm"
                                           ],
                               "question":  "На чертежа симетралата s на страната AC на ΔABC пресича страната AB в точка Q. Ако AB = 14 cm и BC = 4 cm, то периметърът на ΔQBC е равен на:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "В равностранния триъгълник MB = 12 cm. В правоъгълния ΔMNB ∠B = 60°, следователно ∠BMN = 30°. Катетът срещу ъгъл 30° е наполовина от хипотенузата: NB = MB / 2 = 6 cm. Тогава CN = BC – NB = 24 – 6 = 18 cm.",
                               "answers":  [
                                               "20 cm",
                                               "18 cm",
                                               "16 cm",
                                               "12 cm"
                                           ],
                               "question":  "За равностранния ΔABC точката M е средата на AB и MN ⊥ BC. Ако AB = 24 cm, то дължината на отсечката CN е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "∠A = 90° – 30° = 60°. Тъй като AL е ъглополовяща, ∠BAL = ∠CAL = 30°. ΔABL е равнобедрен (два ъгъла по 30°), следователно AL = BL = 18 cm. В правоъгълния ΔALC катетът CL е срещу ъгъл 30° (∠CAL), значи CL = AL / 2 = 9 cm. BC = BL + CL = 18 + 9 = 27 cm.",
                               "answers":  [
                                               "9 cm",
                                               "18 cm",
                                               "27 cm",
                                               "36 cm"
                                           ],
                               "question":  "На чертежа ΔABC е правоъгълен, ∠ABC = 30° и отсечката AL е ъглополовяща на ∠BAC. Ако BL = 18 cm, то дължината на страната BC е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "В правоъгълния ΔMDB катетът MD = 2 cm е срещу ъгъл 30°, следователно хипотенузата MB = 4 cm. Тъй като M лежи на симетралата на BC, то CM = MB = 4 cm.",
                               "answers":  [
                                               "6 cm",
                                               "4 cm",
                                               "3 cm",
                                               "2 cm"
                                           ],
                               "question":  "На чертежа в ΔABC ∠ABC = 30° и симетралата на страната BC пресича AB в точка M. Ако разстоянието от M до BC е 2 cm (MD ⊥ BC), дължината на отсечката CM е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "От AN = CN следва, че ΔANC е равнобедрен и ∠A = ∠ACN = x. Външният ъгъл ∠CNB = ∠A + ∠ACN = 2x = 70°, значи x = 35°. Тъй като CN е ъглополовяща, ∠C = 2x = 70°. В ΔABC ∠B = 180° – (35° + 70°) = 75°.",
                               "answers":  [
                                               "35°",
                                               "70°",
                                               "75°",
                                               "105°"
                                           ],
                               "question":  "В ΔABC отсечката CN е ъглополовяща на ∠ACB, ∠CNB = 70° и AN = CN. Мярката на ∠ABC е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "По определение симетралата на отсечка е права, която е перпендикулярна на отсечката и преминава през нейната среда.",
                               "answers":  [
                                               "права, средата, перпендикулярна",
                                               "права, средата, успоредна",
                                               "отсечка, края, перпендикулярна",
                                               "отсечка, края, успоредна"
                                           ],
                               "question":  "Симетрала на отсечка е (1), която минава през (2) на отсечката и е (3) на нея. Липсващите думи в определението са:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "В ΔABC ∠B = 180° – (135° + 25°) = 20°. За еднаквост по втори признак (страна и два прилежащи ъгъла) е необходимо ∠C1 = ∠C = 135°, тъй като вече имаме AB = A1B1 и ∠B = ∠B1 = 20°.",
                               "answers":  [
                                               "∠A1C1B1 = 135°",
                                               "A1B1 = A1C1",
                                               "A1C1 = B1C1",
                                               "∠A1C1B1 = 25°"
                                           ],
                               "question":  "Дадени са ΔABC и ΔA1B1C1, за които AB = A1B1, ∠A = 25°, ∠C = 135° и ∠B1 = 20°. ΔABC ≅ ΔA1B1C1 по втори признак, ако:",
                               "correctAnswerKey":  "answer_1"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Геометричното място на точките, които се намират на равни разстояния от краищата на една отсечка (AO = OB), е симетралата на тази отсечка (AB).",
                                "answers":  [
                                                "ъглополовящата на ∠ACB",
                                                "симетралата на страната AB",
                                                "височината през C към AB",
                                                "медианата през C към AB"
                                            ],
                                "question":  "На чертежа ΔABC е разностранен. Ако AO = OB, то точка O лежи на:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "ВправоъгълнияΔABC, ∠A = 180° – (90° + 30°) = 60°. Тъйкато M лежинасиметралатана AC, то MA = MC иΔAMC еравнобедрен. Следователно∠ACM = ∠A = 60°.",
                                "answers":  [
                                                "30°",
                                                "45°",
                                                "60°",
                                                "90°"
                                            ],
                                "question":  "На чертежа s_AC е симетралата на страната AC на ΔABC и пресича страната AB в точка M. Ако ∠ABC = 30° и ∠ACB = 90°, то мярката на ∠ACM е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Тъйкато∠A = 60°, то∠BAL = ∠CAL = 30°. ΔABL еравнобедрен (дваъгълапо 30°), следователно AL = BL = 18 cm. ВправоъгълнияΔALC катетът CL есрещуъгъл 30°, значи CL = AL / 2 = 9 cm. Дължината BC = BL + CL = 18 + 9 = 27 cm.",
                                "answers":  [
                                                "9 cm",
                                                "18 cm",
                                                "27 cm",
                                                "36 cm"
                                            ],
                                "question":  "ВправоъгълнияΔABC (∠C = 90°) отсечката AL еъглополовящана∠BAC. Ако∠ABC = 30° и BL = 18 cm, тодължинатанастраната BC е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Точка D лежи на симетралата на AB, затова AD = BD. Периметърът на ΔBDC е BC + CD + BD = BC + CD + AD = BC + AC = 20. След заместване с AC = 12 cm получаваме BC + 12 = 20, откъдето BC = 8 cm.",
                                "answers":  [
                                                "4 cm",
                                                "8 cm",
                                                "12 cm",
                                                "16 cm"
                                            ],
                                "question":  "НачертежавΔABC s есиметралатанастраната AB. Ако AC = 12 cm ипериметърътнаΔBDC е 20 cm, дължинатанастраната BC е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Двата триъгълника са правоъгълни, имат общ ъгъл при върха C и равни катети AD = BH по условие. Те са еднакви по признака за катет и остър ъгъл.",
                                "answers":  [
                                                "първи",
                                                "втори",
                                                "трети",
                                                "четвърти (за правоъгълни триъгълници)"
                                            ],
                                "question":  "В триъгълник ABC височините AD и BH са равни. Триъгълниците ΔADC и ΔBHC са еднакви по признака:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "В двата триъгълника имаме по един равен ъгъл по условие (∠A = ∠M) и по един равен ъгъл като връхни (∠ABC = ∠MBN). За да са еднакви по втори признак, страните между тези ъгли трябва да са равни, т.е. AB = BM.",
                                "answers":  [
                                                "CB = BM",
                                                "AB = BN",
                                                "CB = MN",
                                                "AB = BM"
                                            ],
                                "question":  "На чертежа за ΔABC и ΔMBN е известно, че AN ∩ CM = B и ∠BAC = ∠BMN. Кое допълнително условие е достатъчно, за да са еднакви по втори признак?",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Понеже M е от симетралата, то MB = MC. Тогава P_ABM = AB + AM + MB = AB + AM + MC = AB + AC = 13 cm. Като заместим AB = 4 cm, получаваме 4 + AC = 13, откъдето AC = 9 cm.",
                                "answers":  [
                                                "4 cm",
                                                "7 cm",
                                                "9 cm",
                                                "13 cm"
                                            ],
                                "question":  "В равнобедрения ΔABC (AC = BC) симетралата на страната BC пресича AC в точка M. Ако AB = 4 cm и периметърът на ΔABM е 13 cm, то страната AC е дълга:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "∠BAL = ∠ALD = 52° като кръстни ъгли. Тъй като AL е ъглополовяща, то ∠DAL = 52°, откъдето целият ∠DAB = 104°. Сборът на прилежащите ъгли в успоредника е 180°, затова ∠ADC = 180° – 104° = 76°.",
                                "answers":  [
                                                "52°",
                                                "76°",
                                                "104°",
                                                "128°"
                                            ],
                                "question":  "На чертежа ABCD е успоредник и AL е ъглополовяща на ∠DAB. Ако ∠ALD = 52°, мярката на ∠ADC е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Тъй като AN = CN, ΔANC е равнобедрен и ∠A = ∠ACN = x. Външният ∠CNB = ∠A + ∠ACN = 2x = 70°, откъдето x = 35°. Тъй като CN е ъглополовяща, ∠ACB = 2x = 70°.",
                                "answers":  [
                                                "35°",
                                                "50°",
                                                "70°",
                                                "105°"
                                            ],
                                "question":  "В ΔABC отсечката CN е ъглополовяща на ∠ACB. Ако AN = CN и ∠CNB = 70°, то мярката на ∠ACB е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Това е основното свойство на симетралата на отсечка, дефинирано в учебното съдържание.",
                                "answers":  [
                                                "Всяка точка от симетралата е на равно разстояние от краищата на отсечката.",
                                                "Симетралата минава през произволна точка от отсечката.",
                                                "Всяка точка от симетралата е на равно разстояние от правата, съдържаща отсечката.",
                                                "Симетралата е успоредна на отсечката."
                                            ],
                                "question":  "Кое от следните твърдения за точките от симетралата на отсечка е ВЯРНО?",
                                "correctAnswerKey":  "answer_1"
                            }
                        ]
          },
    "6":  {
              "main":  [
                           {
                               "explanation":  "В правоъгълния триъгълник ∠A = 180° – (90° + 30°) = 60°. Понеже M лежи на симетралата на AC, то MA = MC и ΔAMC е равнобедрен с ъгъл 60°, което го прави равностранен. Следователно CM = AC = 4 cm.",
                               "answers":  [
                                               "8 cm",
                                               "6 cm",
                                               "4 cm",
                                               "2 cm"
                                           ],
                               "question":  "В правоъгълния ΔABC (∠C = 90°) мярката на ∠ABC = 30° и страната AC = 4 cm. Симетралата на страната AC пресича хипотенузата AB в точка M. Дължината на отсечката CM е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "В правоъгълника ъгълът при върха C е 90°, следователно ∠CAB + ∠ACB = 90°. От отношението 2 : 3 намираме 2x + 3x = 90°, откъдето x = 18° и ∠CAB = 2 * 18° = 36°.",
                               "answers":  [
                                               "18°",
                                               "36°",
                                               "54°",
                                               "72°"
                                           ],
                               "question":  "В правоъгълника ABCD диагоналите се пресичат в точка O. Ако DM ⊥ AC (M ∈ AC) и ∠CAB : ∠ACB = 2 : 3, то градусната мярка на ∠CAB е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "В ромба триъгълник ΔABC е равнобедрен (AB = BC). Ъгъл ∠ABC = 180° – 52° = 128°. Тогава ∠BAC = (180° – 128°) / 2 = 26°. Тъй като AL е ъглополовяща, ∠BAL = 13°. В ΔABL ъгъл ∠ALB = 180° – (128° + 13°) = 39°.",
                               "answers":  [
                                               "52°",
                                               "39°",
                                               "26°",
                                               "13°"
                                           ],
                               "question":  "В ромба ABCD ∠BAD = 52°, а AL (L ∈ BC) е ъглополовящата на ∠BAC. Мярката на ∠ALB е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "В правоъгълните триъгълници NO и QO са медиани към общата хипотенуза MP. По свойство медианата към хипотенузата е равна на половината от нея, т.е. NO = QO = OP = 2 cm. Следователно ΔNOQ е равнобедрен.",
                               "answers":  [
                                               "разностранен",
                                               "равнобедрен",
                                               "равностранен",
                                               "правоъгълен"
                                           ],
                               "question":  "Триъгълниците ΔMPQ и ΔMPN са правоъгълни с обща хипотенуза MP. Точката O е средата на MP и OP = 2 cm. Какъв е видът на ΔNOQ според страните му?",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "В равностранния триъгълник MB = 12 cm и ∠B = 60°. В правоъгълния ΔMNB ъгъл ∠BMN = 30°. Катетът NB, лежащ срещу 30°, е равен на половината от хипотенузата MB, т.е. NB = 6 cm. Тогава CN = BC – NB = 24 – 6 = 18 cm.",
                               "answers":  [
                                               "20 cm",
                                               "18 cm",
                                               "16 cm",
                                               "12 cm"
                                           ],
                               "question":  "За равностранния ΔABC точката M е средата на AB и MN ⊥ BC (N ∈ BC). Ако AB = 24 cm, то дължината на отсечката CN е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Ъглите ∠ALD и ∠LDC са кръстни при успоредните прави AB и CD, затова ∠LDC = 65°. Понеже DL е ъглополовяща, ∠ADC = 2 * 65° = 130°. В успоредника сборът на прилежащите ъгли е 180°, значи ∠DAB = 180° – 130° = 50°.",
                               "answers":  [
                                               "50°",
                                               "60°",
                                               "65°",
                                               "130°"
                                           ],
                               "question":  "В успоредника ABCD DL е ъглополовящата на ∠ADC (L ∈ AB) и ∠ALD = 65°. Мярката на ∠DAB е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "От отношението и дадената дължина на AH намираме HC = 4 cm. ΔHBC е правоъгълен с катети HB = AH = 3 cm (в равнобедрен триъгълник височината към основата е и медиана) и HC = 4 cm. По Питагоровата теорема (или като питагоров триъгълник) BC = 5 cm.",
                               "answers":  [
                                               "3 cm",
                                               "4 cm",
                                               "5 cm",
                                               "6 cm"
                                           ],
                               "question":  "На чертежа ΔABC е равнобедрен (AC = BC), CH е височина, AH = 3 cm и AH : HC = 3 : 4. Дължината на бедрото BC е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Понеже ∠ADB = 60°, ромбът се състои от два равностранни триъгълника и ∠BCD = 60°. В правоъгълния ΔOBC отсечката OM е медиана към хипотенузата BC, следователно OM = MC и ΔOMC е равнобедрен с ъгъл 60°, т.е. равностранен. Тогава ∠COM = 60°.",
                               "answers":  [
                                               "30°",
                                               "45°",
                                               "60°",
                                               "90°"
                                           ],
                               "question":  "В ромба ABCD диагоналите се пресичат в точка O, точката M е средата на BC и ∠ADB = 60°. По данните от чертежа мярката на ∠COM е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "В равностранния триъгълник ∠A = 60°. В правоъгълния ΔAPM ъгъл ∠APM = 30°. Катетът AM, лежащ срещу този ъгъл, е AM = AP / 2 = 2 cm. Тогава страната AB = AM + MB = 2 + 5 = 7 cm.",
                               "answers":  [
                                               "13 cm",
                                               "14 cm",
                                               "9 cm",
                                               "7 cm"
                                           ],
                               "question":  "В равностранния ΔABC от точка P (P ∈ AC) е издигнат перпендикуляр PM ⊥ AB (M ∈ AB). Ако AP = 4 cm и MB = 5 cm, то дължината на страната AB е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "∠A = 60°, затова∠BAL = ∠CAL = 30°. ΔABL еравнобедрен (дваъгълапо 30°), следователно AL = BL = 18 cm. ВправоъгълнияΔALC катетът CL есрещуъгъл 30°, значи CL = AL / 2 = 9 cm. BC = BL + CL = 18 + 9 = 27 cm.",
                               "answers":  [
                                               "9 cm",
                                               "18 cm",
                                               "27 cm",
                                               "36 cm"
                                           ],
                               "question":  "В правоъгълния ΔABC (∠C = 90°) отсечката AL е ъглополовяща на ∠BAC. Ако ∠ABC = 30° и BL = 18 cm, то дължината на страната BC е:",
                               "correctAnswerKey":  "answer_3"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "В правоъгълния ΔABC с ъгъл 30°, хипотенузата AB е 2 * AC = 8 cm. Тъй като ∠A = 60°, в правоъгълния ΔAHC (∠H = 90°) ъгъл ∠ACH = 30°. Катетът AH, лежащ срещу него, е половината от хипотенузата AC, следователно AH = 4 / 2 = 2 cm.",
                                "answers":  [
                                                "1 cm",
                                                "2 cm",
                                                "4 cm",
                                                "8 cm"
                                            ],
                                "question":  "За ΔABC на чертежа е дадено, че ∠ACB = 90°, ∠ABC = 30° и страната AC = 4 cm. Дължината на височината AH е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Тъй като AM е ъглополовяща, ΔADM е равнобедрен и AD = DM = a. Аналогично BN е ъглополовяща и BC = NC = a. Понеже страната DC е разделена на три равни части (DM = MN = NC = a), то DC = 3a. Периметърът е 2 * (a + 3a) = 8a.",
                                "answers":  [
                                                "16a",
                                                "10a",
                                                "8a",
                                                "6a"
                                            ],
                                "question":  "Ъглополовящите AM и BN в успоредника ABCD разделят страната DC на три равни части. Дължината на страната BC е a cm. Периметърът на успоредника ABCD в сантиметри е равен на:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Периметърът е 40 cm, значи страната на ромба е 10 cm. По чертежа в мрежата се определя, че височината на ромба спрямо страната му е 8 единици. Лицето е страна по височина: 10 * 8 = 80 cm².",
                                "answers":  [
                                                "80 cm²",
                                                "50 cm²",
                                                "40 cm²",
                                                "20 cm²"
                                            ],
                                "question":  "В квадратна мрежа с единична отсечка x cm е начертан ромб ABCD. Ако обиколката на ромба е 40 cm, то лицето му е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Сборът на два прилежащи ъгъла в успоредника е 180°. Означаваме ги с 2x и 7x. 9x = 180° =\u003e x = 20°. Ъглите са 40° и 140°. Разликата им е 140° – 40° = 100°.",
                                "answers":  [
                                                "40°",
                                                "100°",
                                                "140°",
                                                "150°"
                                            ],
                                "question":  "Мерките на два от ъглите на успоредник се отнасят както 2 : 7. Разликата от мерките на двата ъгъла е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Отсечките MP и MN са медиани към хипотенузата AB в правоъгълните ΔABP и ΔABN. По свойство MP = MN = AB / 2 = AM. По условие PN = AM, следователно MP = MN = PN, което прави триъгълника равностранен.",
                                "answers":  [
                                                "разностранен",
                                                "равностранен",
                                                "равнобедрен, но не равностранен",
                                                "правоъгълен"
                                            ],
                                "question":  "В остроъгълния ΔABC с височини AN и BP (N ∈ BC, P ∈ AC) точката M е средата на AB. Какъв е видът на ΔMNP, ако PN = AM?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "ΔBCF е равнобедрен (CF = BF), затова ∠BCF = ∠B = x. Външният за него ъгъл ∠CFA = 2x. Тъй като ΔACF е равнобедрен (AC = CF), ∠A = ∠CFA =\u003e x + 25° = 2x, откъдето x = 25°. Тогава ∠A = 50°, ∠B = 25° и ∠ACB = 180° – (50° + 25°) = 105°.",
                                "answers":  [
                                                "130°",
                                                "105°",
                                                "90°",
                                                "80°"
                                            ],
                                "question":  "В ΔABC върху страната AB е взета точка F така, че AC = CF = BF. Ако ∠A = x + 25° и ∠B = x, то мярката на ∠ACB е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Нека∠ABC = 2x. Тогава∠A = 2x и∠LBA = x. Ъгъл∠BLC евъншензаΔABL, следователно∠BLC = ∠A + ∠LBA = 2x + x = 3x. 3x = 60° =\u003e x = 20°. Ъглите при основата са по 40°, откъдето ∠ACB = 180° – 80° = 100°.",
                                "answers":  [
                                                "100°",
                                                "80°",
                                                "60°",
                                                "40°"
                                            ],
                                "question":  "В ΔABC (AC = BC) BL е ъглополовяща на ∠ABC и ∠BLC = 60°. Мярката на ∠ACB е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Понеже DM е ъглополовяща, ∠ADM = ∠MDC. От успоредността на AB и CD следва, че ∠MDC = ∠AMD като кръстни. Тогава ΔADM е равнобедрен и AM = AD = 4 cm. Страната AB = AM + MB = 4 + 3 = 7 cm. Периметърът е 2 * (4 + 7) = 22 cm.",
                                "answers":  [
                                                "14 cm",
                                                "18 cm",
                                                "20 cm",
                                                "22 cm"
                                            ],
                                "question":  "На чертежа ABCD е успоредник, DM е ъглополовяща на ∠ADC. Ако AD = DM = 4 cm и MB = 3 cm, то периметърът на успоредника е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "В правоъгълника ъгъл ∠BCD = 90°, откъдето ∠CAB + ∠ACB = 90°. От отношението 2 : 3 имаме 2x + 3x = 90°, следователно 5x = 90° и x = 18°. ∠CAB = 2 * 18° = 36°.",
                                "answers":  [
                                                "18°",
                                                "36°",
                                                "54°",
                                                "72°"
                                            ],
                                "question":  "В правоъгълника ABCD диагоналите се пресичат в точка O. Ако DM ⊥ AC и ∠CAB : ∠ACB = 2 : 3, то градусната мярка на ∠CAB е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Точка O е център на описаната окръжност (OA = OB = OC). ΔOAC е равнобедрен и ∠OAC = ∠OCA = 42°. ΔOAB е равнобедрен и ∠OAB = ∠OBA = 35°. Тогава ∠BAC = 42° + 35° = 77°. Централният ъгъл ∠BOC е два пъти по-голям от съответния вписан ъгъл, следователно ∠BOC = 2 * 77° = 154°.",
                                "answers":  [
                                                "120°",
                                                "145°",
                                                "154°",
                                                "167°"
                                            ],
                                "question":  "Симетралите на страните AB и AC на ΔABC се пресичат в точка O. Ако ∠OCA = 42° и ∠OBA = 35°, то мярката на ∠BOC е:",
                                "correctAnswerKey":  "answer_3"
                            }
                        ]
          },
    "7":  {
              "main":  [
                           {
                               "explanation":  "Тъй като обиколката на ромба е 40 cm, страната му е a = 40 : 4 = 10 cm. От чертежа в мрежата се установява, че височината h съответства на 8 единици. Лицето се пресмята по формулата S = a.h = 10 . 8 = 80 cm².",
                               "answers":  [
                                               "20 cm²",
                                               "40 cm²",
                                               "50 cm²",
                                               "80 cm²"
                                           ],
                               "question":  "В квадратна мрежа с единична отсечка xcm е начертан ромб ABCD. Ако обиколката на ромба е 40 cm, то лицето му е:",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Координатите на точка B са (3; –4). Отсечката AB е вертикална с дължина |4 – (–4)| = 8 cm. Тя служи за основа на триъгълника, а височината към нея от върха O (0; 0) е разстоянието от О до правата x = 3, което е 3 cm. Лицето S = (8 . 3) / 2 = 12 cm².",
                               "answers":  [
                                               "6 cm²",
                                               "12 cm²",
                                               "18 cm²",
                                               "24 cm²"
                                           ],
                               "question":  "В координатна система Oxy с единична отсечка 1 cm е дадена точка А (3; 4). Точката B е симетрична на А относно абсцисната ос Ox. Лицето на ΔAOB е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Отсечката AD лежи на вертикална права и има дължина |4 – (–1)| = 5 единици. Височината на успоредника към тази основа е хоризонталното разстояние от точка C (1; 0) до правата x = –2, което е |1 – (–2)| = 3 единици. Лицето S = AD . h = 5 .3 = 15 кв. единици.",
                               "answers":  [
                                               "15 кв. единици",
                                               "12 кв. единици",
                                               "9 кв. единици",
                                               "6 кв. единици"
                                           ],
                               "question":  "В декартова координатна система са дадени точките А (–2; –1), C (1; 0) и D (–2; 4). Ако ABCD е успоредник, лицето му е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Точка C е симетрична на A (–3; –2) спрямо оста Oy, следователно C има координати (3; –2). Отсечката AC е хоризонтална с дължина |3 – (–3)| = 6 cm. Височината от B (2; 1) към AC е вертикалното разстояние |1 – (–2)| = 3 cm. Лицето S = (6 . 3) / 2 = 9 cm².",
                               "answers":  [
                                               "18 cm²",
                                               "10 cm²",
                                               "9 cm²",
                                               "6 cm²"
                                           ],
                               "question":  "В правоъгълна координатна система са отбелязани точките А (–3; –2) и В (2; 1). Точката С е симетрична на точка А спрямо ординатната ос Оy. Лицето на ΔАВС е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Лицето на триъгълника в мрежа може да се пресметне чрез обграждащ правоъгълник и изваждане на лицата на околните правоъгълни триъгълници. Според изпитното ръководство, лицето е 11 cm².",
                               "answers":  [
                                               "22 cm²",
                                               "15 cm²",
                                               "11 cm²",
                                               "8 cm²"
                                           ],
                               "question":  "В координатна система Oxy с единична отсечка 1 cm са дадени точките M (–2; 4), N (1; 1) и P (5; 3). Лицето на ΔMNP е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "В ромба ъгъл ∠DAB е равен на ∠HDP = 30° (ъгли с взаимноперпендикулярни рамена). В правоъгълния ΔADH катетът DH лежи срещу 30°, следователно DH = AD / 2 = 6 / 2 = 3 cm. Лицето на ромба е S = AB . DH = 6 . 3 = 18 cm².",
                               "answers":  [
                                               "36 cm²",
                                               "18 cm²",
                                               "9 cm²",
                                               "72 cm²"
                                           ],
                               "question":  "В ромба АВСD височините DH и DP са спуснати съответно към страните AB и BC. Ако страната на ромба е 6 cm и ∠HDP = 30°, то лицето му е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Тъй като M е среда на хипотенузата AB, то медианата DM = AB / 2, откъдето AB = 10 cm. Точка C е на симетралата на AB, значи ΔABC е равнобедрен правоъгълен и височината CM е медиана към хипотенузата. Тогава CM = AB / 2 = 5 cm. Лицето S_ABC = (AB . CM) / 2 = (10 . 5) / 2 = 25 cm².",
                               "answers":  [
                                               "50 cm²",
                                               "25 cm²",
                                               "12,5 cm²",
                                               "10 cm²"
                                           ],
                               "question":  "На чертежа правоъгълните ΔABC и ΔABD са с обща хипотенуза AB. Точката C лежи на симетралата на AB и M е средата на AB. Ако DM = 5 cm, лицето на ΔABC е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "В правоъгълния триъгълник медианата към хипотенузата DM е равна на половината от нея, т.е. DM = 2 cm. Тъй като триъгълникът е и равнобедрен (по условие на задачата), медианата DM е и височина. Лицето S = (BC . DM) / 2 = (4 . 2) / 2 = 4 cm².",
                               "answers":  [
                                               "8 cm²",
                                               "4 cm²",
                                               "2 cm²",
                                               "1 cm²"
                                           ],
                               "question":  "В правоъгълния ΔBDC с хипотенуза BC = 4 cm, отсечката DM е медиана. Лицето на ΔBDC е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Доказва се, че ΔAFK ≅ ΔDLK, откъдето AF = DL = m. Лицето на ΔDLC е (DL . n) / 2 = (m . n) / 2. Тъй като ΔDLC и успоредникът имат обща страна DC и обща височина (DK), лицето на успоредника е два пъти по-голямо от това на триъгълника, т.е. S = m .n.",
                               "answers":  [
                                               "m .n",
                                               "(m .n) / 2",
                                               "2 .m .n",
                                               "m + n"
                                           ],
                               "question":  "В успоредника ABCD височината DK пресича диагонала AC в точка F. Ако AF = m и височината на ΔDLC към страната DL е n, лицето на успоредника ABCD е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Чрез изразяване на височините и основите в правоъгълните триъгълници се доказва, че отношението на техните лица е S_NHM : S_CMH = 2 : 3.",
                               "answers":  [
                                               "1 : 2",
                                               "2 : 3",
                                               "3 : 4",
                                               "1 : 1"
                                           ],
                               "question":  "На чертежа лицето на ΔNHM се отнася към лицето на ΔCMH като:",
                               "correctAnswerKey":  "answer_2"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Точка C е симетрична на A (–3; –2) спрямо оста Oy, следователно C има координати (3; –2). Отсечката AC е хоризонтална с дължина |3 – (–3)| = 6 cm. Височината от B (2; 1) към AC е вертикалното разстояние от ординатата на B до ординатата на A, т.е. |1 – (–2)| = 3 cm. Лицето S = (основа . височина) / 2 = (6 . 3) / 2 = 9 cm².",
                                "answers":  [
                                                "18 cm²",
                                                "10 cm²",
                                                "9 cm²",
                                                "6 cm²"
                                            ],
                                "question":  "В правоъгълна координатна система Oxy с единична отсечка 1 cm са отбелязани точките А (–3; –2) и В (2; 1). Точката С е симетрична на точка А спрямо ординатната ос Оy. Лицето на ΔАВС е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Тъй като OD е ъглополовяща на ∠BOC, то ∠BOC = 2 .∠COD = 2 . 63° = 126°. Ъглите ∠AOB и ∠BOC са съседни (лежать на правата AC), затова тяхната сума е 180°. Следователно ∠AOB = 180° – 126° = 54°.,",
                                "answers":  [
                                                "126°",
                                                "117°",
                                                "63°",
                                                "54°"
                                            ],
                                "question":  "Точката О лежи на правата АС и лъчът OD е ъглополовящата на ∠BOC. Ако ∠COD = 63°, то мярката на ∠AOB е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "В правоъгълния ΔABC ∠A = 90° – 30° = 60°. Тъй като AL е ъглополовяща, ∠BAL = ∠CAL = 30°. ΔABL е равнобедрен (ъгли 30° и 30°), значи AL = BL = 18 cm. В правоъгълния ΔALC катетът CL лежи срещу ъгъл 30°, затова CL = AL / 2 = 9 cm. Дължината BC = BL + CL = 18 + 9 = 27 cm.",
                                "answers":  [
                                                "9 cm",
                                                "18 cm",
                                                "27 cm",
                                                "36 cm"
                                            ],
                                "question":  "На чертежа ΔABC е правоъгълен, ∠ABC = 30° и отсечката AL е ъглополовяща на ∠BAC. Ако BL = 18 cm, то дължината на страната BC е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Вътрешният ъгъл, съседен на 114°, е 180° – 114° = 66°. Понеже правите са успоредни, ъгъл x е равен на сумата от двата вътрешни кръстни ъгъла (или се пресмята чрез спомагателна успоредна права), което дава x = 66° + 21° = 87°.",
                                "answers":  [
                                                "45°",
                                                "66°",
                                                "87°",
                                                "135°"
                                            ],
                                "question":  "На чертежа правите a и b са успоредни. Ако един от получените външни ъгли е 114°, а друг остър ъгъл при втората права е 21°, то градусната мярка на ъгъл x (сбор от вътрешните кръстни ъгли) е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Тъй като ∠ADB = 60°, ромбът е съставен от два равностранни триъгълника и ∠BCD = 60°. Диагоналите са перпендикулярни, затова ΔOBC е правоъгълен. OM е медиана към хипотенузата BC, значи OM = MC. ΔOMC е равнобедрен с ъгъл 60°, т.е. равностранен, откъдето ∠COM = 60°.",
                                "answers":  [
                                                "30°",
                                                "45°",
                                                "60°",
                                                "90°"
                                            ],
                                "question":  "В ромба ABCD диагоналите се пресичат в точка O, точката M е средата на BC и ∠ADB = 60°. Мярката на ∠COM е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Триъгълниците ΔABC и ΔQNM са еднакви по първи признак (SAS). От еднаквостта следва, че ∠CAB = ∠NQM. Като се използват данните за ъглите върху правата AQ, се пресмята, че ∠NQM = 40°.,",
                                "answers":  [
                                                "100°",
                                                "80°",
                                                "60°",
                                                "40°"
                                            ],
                                "question":  "Върху правата AQ са построени ΔABC и ΔMQN, за които AC = QN, BC = MN, ∠ACB = ∠MNQ = 60° и ∠BMN = 100°. Градусната мярка на ∠CAB е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "В правоъгълните триъгълници отсечките NO и QO са медиани към общата хипотенуза MP. По свойство медианата към хипотенузата е равна на половината от нея, следователно NO = MP / 2 и QO = MP / 2. Тъй като NO = QO, триъгълникът е равнобедрен.,",
                                "answers":  [
                                                "разностранен",
                                                "равнобедрен",
                                                "равностранен",
                                                "правоъгълен"
                                            ],
                                "question":  "Триъгълниците ΔMPQ и ΔMPN са правоъгълни с обща хипотенуза MP. Точката O е средата на MP. Какъв е видът на ΔNOQ според страните му?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Сборът на два прилежащи ъгъла в успоредника е 180°. Означаваме ги с 2x и 7x: 2x + 7x = 180° =\u003e 9x = 180° =\u003e x = 20°. Ъглите са 40° и 140°, а тяхната разлика е 140° – 40° = 100°.",
                                "answers":  [
                                                "40°",
                                                "100°",
                                                "140°",
                                                "150°"
                                            ],
                                "question":  "Мерките на два от ъглите на успоредник се отнасят както 2 : 7. Разликата от мерките на двата ъгъла е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Според неравенството в триъгълника, сборът на всеки две страни трябва да е по-голям от третата. Само при 1,5 + 2 \u003e 3 (3,5 \u003e 3) условието е изпълнено за всички двойки страни.",
                                "answers":  [
                                                "0,5; 1,5 и 2",
                                                "1,5; 2 и 3",
                                                "2; 1 и 1",
                                                "3; 2 и 1"
                                            ],
                                "question":  "Дължините в сантиметри на страните на триъгълник могат да са:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Сборът на два съседни ъгъла е 180°. Уравнението е (α + 70°) + α = 180°, което дава 2α = 110°, следователно α = 55°.",
                                "answers":  [
                                                "50°",
                                                "55°",
                                                "65°",
                                                "70°"
                                            ],
                                "question":  "На чертежа при пресичане на две прави са получени съседни ъгли с мерки α + 70° и α. Мярката на ъгъл α е:",
                                "correctAnswerKey":  "answer_2"
                            }
                        ]
          },
    "8":  {
              "main":  [
                           {
                               "explanation":  "Диаметърът е 10 cm, значи радиусът r = 5 cm. Височината h = 3 dm = 30 cm. Формулата за околна повърхнина на цилиндър е S = 2.π.r.h. Заместваме: S = 2.π.5.30 = 300π cm².",
                               "answers":  [
                                               "300π cm²",
                                               "325π cm²",
                                               "350π cm²",
                                               "600π cm²"
                                           ],
                               "question":  "Лицето на околната повърхнина на прав кръгов цилиндър с диаметър 10 cm и височина 3 dm е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Обемът на куб се пресмята по формулата V = a³, където \u0027a\u0027 е дължината на ръба. Тъй като 10³ = 1000, то ръбът е равен на 10 cm.",
                               "answers":  [
                                               "20 cm",
                                               "15 cm",
                                               "10 cm",
                                               "5 cm"
                                           ],
                               "question":  "Кутия за сладки има форма на куб с обем 1000 cm³. Ръбът на кутията е с дължина:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Правилната осмоъгълна пирамида има 8 еднакви околни стени, които са равнобедрени триъгълници. Лицето на околната повърхнина е S = 8 . 18 = 144 cm².",
                               "answers":  [
                                               "108 cm²",
                                               "126 cm²",
                                               "144 cm²",
                                               "162 cm²"
                                           ],
                               "question":  "На чертежа е дадена правилна осмоъгълна пирамида. Лицето на една от околните ѝ стени е 18 cm². Лицето на околната повърхнина на пирамидата е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Първо превръщаме измеренията в дециметри: 20 cm = 2 dm; 300 mm = 3 dm; 5 dm. Обемът е V = a.b.c = 2 .3 . 5 = 30 dm³.",
                               "answers":  [
                                               "3",
                                               "30",
                                               "300",
                                               "3000"
                                           ],
                               "question":  "Трите измерения на правоъгълен паралелепипед са 20 cm, 300 mm и 5 dm. Обемът му в кубически дециметри е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Формулата за околна повърхнина на конус е S = π.r.l. Дадено е 15π = π.r.5, откъдето r = 3 cm. Диаметърът d = 2.r = 2.3 = 6 cm.",
                               "answers":  [
                                               "3 cm",
                                               "6 cm",
                                               "10 cm",
                                               "15 cm"
                                           ],
                               "question":  "Околната повърхнина на прав кръгов конус е 15π cm². Ако образувателната на конуса е 5 cm, то диаметърът на основата е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Обиколката на основата е 4a = 12 dm, значи ръбът a = 3 dm. Обемът е V = a³ = 3³ = 27 dm³. Понеже 1 dm³ = 1 литър, 2/3 от обема е (2/3) . 27 = 18 литра.",
                               "answers":  [
                                               "9 L",
                                               "12 L",
                                               "15 L",
                                               "18 L"
                                           ],
                               "question":  "Цветарник с форма на куб има обиколка на основата 12 dm. Колко литра почва са необходими за запълването на 2/3 от обема на цветарника?",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Височината на водния стълб е 8 – 1 = 7 dm. Обемът на водата се пресмята като произведение на измеренията на основата и височината на водата: V = 9 .4 . 7 = 252 dm³.",
                               "answers":  [
                                               "216 dm³",
                                               "252 dm³",
                                               "256 dm³",
                                               "288 dm³"
                                           ],
                               "question":  "Аквариум има форма на правоъгълен паралелепипед с дължина 9 dm, широчина 4 dm и височина 8 dm. Налива се вода до 1 dm под горния ръб. Обемът на водата в аквариума е:",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Формулата за обем на права призма е V = B.h. При V = 120 и B = 15, намираме h = 120 : 15 = 8 cm.",
                               "answers":  [
                                               "8 cm",
                                               "10 cm",
                                               "12 cm",
                                               "15 cm"
                                           ],
                               "question":  "Лицето на основата на права призма е 15 cm², а обемът ѝ е 120 cm³. Височината на призмата е:",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Лицетонаосноватае B = 6.6 = 36 cm². Обиколкатанаосноватае P = 4.6 = 24 cm. Лицетонаоколнатаповърхнинае S = (P.k)/2 = (24.5)/2 = 60 cm². Пълната повърхнина е S1 = S + B = 60 + 36 = 96 cm².",
                               "answers":  [
                                               "30 cm²",
                                               "60 cm²",
                                               "96 cm²",
                                               "120 cm²"
                                           ],
                               "question":  "Правилна четириъгълна пирамида има основен ръб 6 cm и апотема на околната стена 5 cm. Лицето на повърхнината на пирамидата е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Според списъка с формули, лицето на повърхнина на сфера е 4.π.r².",
                               "answers":  [
                                               "2πr",
                                               "πr²",
                                               "4πr²",
                                               "4/3πr³"
                                           ],
                               "question":  "Сферичен аквариум има радиус r. Лицето на повърхнината на сферата се пресмята по формулата:",
                               "correctAnswerKey":  "answer_3"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Простите числа върху стените на зара са 2, 3 и 5. Тъй като благоприятните изходи са 3, а всички възможни изходи са 6, вероятността е 3/6 = 1/2.",
                                "answers":  [
                                                "0",
                                                "1/3",
                                                "1/2",
                                                "2/3"
                                            ],
                                "question":  "Вероятността при хвърляне на стандартен зар да се падне просто число, е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Зеленитемоливиса3 . 2 = 6. Общиятброймоливие 3 + 6 = 9. Вероятносттадасеизтегличервенмоливе 3/9 = 1/3.",
                                "answers":  [
                                                "1/3",
                                                "2/5",
                                                "3/5",
                                                "2/3"
                                            ],
                                "question":  "В кутия има 3 червени моливи и два пъти повече зелени. Вероятността произволно изваден молив да е червен, е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Думата „КАРЛОВО“ съдържа общо 7 букви. Буквата „О“ се среща 2 пъти. Вероятността е съотношението на броя на буквите „О“ към общия брой букви: 2/7.",
                                "answers":  [
                                                "1/7",
                                                "2/7",
                                                "3/7",
                                                "4/7"
                                            ],
                                "question":  "НаеднаквикартончетасанаписанибуквитеК, А, Р, Л, О, В, О. КакваевероятносттанапроизволноизбранокартончедаенаписанабукватаО?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Общиятбройтопчетае 3 + 2 + 2 = 7. Топчетата, коитонесажълти (зеленитеичервените), саобщо 2 + 2 = 4. Следователновероятносттае 4/7.",
                                "answers":  [
                                                "2/7",
                                                "3/7",
                                                "4/7",
                                                "5/7"
                                            ],
                                "question":  "В кутия са поставени 3 жълти, 2 зелени и 2 червени топчета. Каква е вероятността случайно изтеглено топче да НЕ е жълто?",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Сборът от точките на първите четири изпита е 4 . 23,75 = 95. За да бъде средният успех от пет изпита 25, общият им сбор трябва да е 5 . 25 = 125. На петото изпитване трябва да получи 125 – 95 = 30 точки.",
                                "answers":  [
                                                "25",
                                                "30",
                                                "35",
                                                "40"
                                            ],
                                "question":  "Средниятбройточкинаученикотчетириконтролние 23,75. Колкоточкитрябвадаполучинаследващотоизпитване, задастанесредниятмууспех 25 точки?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Общиятбройчастие 2x + x + 2x + 5x = 10x. Уравнениетое 10x = 120, откъдето x = 12. Отучилище (IV) сасеявили 5x = 5 . 12 = 60 ученици.",
                                "answers":  [
                                                "75",
                                                "60",
                                                "45",
                                                "40"
                                            ],
                                "question":  "На олимпиада се явили 120 ученици от четири училища. Според диаграмата разпределението им по училища е съответно 2x, x, 2x и 5x. Колко ученици са се явили от училище (IV)?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Градусната мярка на сектора за спортни изпълнения е 360° – (150° + 80° + 90°) = 40°. Тъй като 360° съответстват на 90 минути, то 40° съответстват на (40/360) . 90 = 10 минути.",
                                "answers":  [
                                                "10 min",
                                                "15 min",
                                                "20 min",
                                                "40 min"
                                            ],
                                "question":  "Училищнотържествопродължава 90 минути. Поданнитеоткръговатадиаграмасекторитеса: музикални (150°), театрални (80°), танцови (90°) испортни. Колкоминутипродължаватспортнитеизпълнения?",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "За да изолираме k, първо изваждаме 1,20 от двете страни: C – 1,20 = 0,80.k. След това делим на 0,80, което дава k = (C – 1,20) / 0,80.",
                                "answers":  [
                                                "k = (C – 1,20) : 0,80",
                                                "k = (C + 1,20) . 0,80",
                                                "k = 0,80 . (C – 1,20)",
                                                "k = C : 2,00"
                                            ],
                                "question":  "Цената за такси се определя по формулата C = 1,20 + 0,80.k, където k са километрите. От тази формула изминатите километри k се определят така:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Лицето на стена (I) е h . a = 8 . a = 72, откъдето a = 9 dm. Лицето на дъното е a . b = 9 . b = 36, откъдето b = 4 dm.",
                                "answers":  [
                                                "a = 9; b = 4",
                                                "a = 8; b = 4,5",
                                                "a = 9; b = 8",
                                                "a = 6; b = 6"
                                            ],
                                "question":  "Майстор изработва аквариум с височина 8 dm. Лицето на едната странична стена (I) е 72 dm², а на дъното (II) е 36 dm². Стойностите на измеренията на дъното a и b са:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Има само един верен отговор (благоприятен изход) от общо четири предложени (всички възможни изходи). Следователно вероятността е 1/4.",
                                "answers":  [
                                                "3/4",
                                                "1/2",
                                                "1/3",
                                                "1/4"
                                            ],
                                "question":  "В тест по математика всяка задача има по четири възможни отговора, от които само един е правилен. Ученик избира случаен отговор. Каква е вероятността той да е верен?",
                                "correctAnswerKey":  "answer_4"
                            }
                        ]
          },
    "9":  {
              "main":  [
                           {
                               "explanation":  "Задачи от среща се решават чрез сбора на скоростите: 60 + 90 = 150 km/h. Времето t = S / v_сбор = 400 / 150 = 8/3 часа. Това е 2 часа и 2/3 от часа (40 минути).",
                               "answers":  [
                                               "2 h",
                                               "2 h 20 min",
                                               "2 h 36 min",
                                               "2 h 40 min"
                                           ],
                               "question":  "Камион и лека кола тръгват едновременно един срещу друг от два пункта на разстояние 400 km. Ако скоростите им са съответно 60 km/h и 90 km/h, след колко време ще се срещнат?",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Производителността на първия е 1/5, а на втория е 1/3. Общата им производителност е 1/5 + 1/3 = 8/15. Времето за 4/5 от работата е (4/5) / (8/15) = (4/5) . (15/8) = 3/2 часа, което е 1 h 30 min.",
                               "answers":  [
                                               "2 h 20 min",
                                               "2 h 30 min",
                                               "1 h 20 min",
                                               "1 h 30 min"
                                           ],
                               "question":  "Един снегорин почиства булевард за 5 часа, а втори – за 3 часа. За колко часа двата снегорина заедно ще почистят 4/5 от този булевард?",
                               "correctAnswerKey":  "answer_4"
                           },
                           {
                               "explanation":  "Количеството на чистия метал се намира като процент от общата маса: 40% от 50 = 0,4 . 50 = 20 kg.",
                               "answers":  [
                                               "2 kg",
                                               "4 kg",
                                               "20 kg",
                                               "40 kg"
                                           ],
                               "question":  "В 50 kg сплав има 40% сребро. Колко килограма е среброто в тази сплав?",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Общата производителност е 1/6 + 1/4 = 5/12. Времето за цялата работа е 12/5 часа. 12/5 = 2,4 часа = 2 часа и 0,4 . 60 = 24 минути.",
                               "answers":  [
                                               "2 h",
                                               "2,04 h",
                                               "2 h 24 min",
                                               "1 h 44 min"
                                           ],
                               "question":  "Мария почиства сама жилището си за 6 часа, а майка ѝ го почиства за 4 часа. За колко време ще го почистят, ако работят заедно?",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Уравнението за чиста масленост е: 2.x + 3.3 = 5.3,6. Получаваме 2x + 9 = 18, откъдето 2x = 9 и x = 4,5%.",
                               "answers":  [
                                               "4%",
                                               "4,5%",
                                               "6%",
                                               "6,4%"
                                           ],
                               "question":  "Колко процента е маслеността на мляко, ако при смесването на 2 литра от него с 3 литра мляко с 3% масленост се получават 5 литра мляко с 3,6% масленост?",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Скоростта на втория е 1296 / 60 = 21,6 m/s. Разликата е 21,6 - 20 = 1,6 m/s.",
                               "answers":  [
                                               "0,6 m/s",
                                               "1,6 m/s",
                                               "20,6 m/s",
                                               "21,6 m/s"
                                           ],
                               "question":  "Един велосипедист се движи със скорост 20 m/s, а друг изминава 1296 m за 1 минута. С колко метра в секунда вторият е по-бърз от първия?",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Ако x са дните по план, то 84(x - 3) = 75x + 180. След решаване: 84x - 252 = 75x + 180 =\u003e 9x = 432 =\u003e x = 48 дни.",
                               "answers":  [
                                               "48",
                                               "45",
                                               "40",
                                               "38"
                                           ],
                               "question":  "Бригада планира добив по 75 m³ на ден. Реално добива по 84 m³ и завършва 3 дни по-рано, като добива 180 m³ повече от плана. За колко дни е планирана работата?",
                               "correctAnswerKey":  "answer_1"
                           },
                           {
                               "explanation":  "Разстоянията до средата са равни: 2.v = (5/3).(v + 15). Оттук 6v = 5v + 75, т.е. v_автобус = 75 km/h. Скоростта на колата е 75 + 15 = 90 km/h.",
                               "answers":  [
                                               "75 km/h",
                                               "80 km/h",
                                               "90 km/h",
                                               "100 km/h"
                                           ],
                               "question":  "Автобус и кола се срещат на бензиностанция по средата на пътя между А и В. Автобусът е пътувал 2 часа, а колата (която е с 15 km/h по-бърза) – 1 час и 40 минути. Скоростта на колата е:",
                               "correctAnswerKey":  "answer_3"
                           },
                           {
                               "explanation":  "Момичетата са 25 - 18 = 7. Процентът им е (7 / 25) . 100 = 28%.",
                               "answers":  [
                                               "72%",
                                               "28%",
                                               "18%",
                                               "7%"
                                           ],
                               "question":  "В клас от 25 ученици 18 са момчета. Колко процента са момичетата?",
                               "correctAnswerKey":  "answer_2"
                           },
                           {
                               "explanation":  "Времето на чирака за 60 чашки е 60 + 0,25 . 60 = 75 минути. За 60 минути (1 час) той ще направи (60 / 75) . 60 = 48 чашки.",
                               "answers":  [
                                               "45",
                                               "48",
                                               "50",
                                               "75"
                                           ],
                               "question":  "Майстор изработва 60 чашки за 1 час. Чиракът се нуждае от 25% повече време за същия брой чашки. Колко чашки изработва чиракът за 1 час?",
                               "correctAnswerKey":  "answer_2"
                           }
                       ],
              "extra":  [
                            {
                                "explanation":  "Пътят на отиване е 6x. Времето на връщане е 6 / 3 = 2 часа, а скоростта е (x + 4). Тъй като пътят е един и същ, 6x = 2(x + 4).",
                                "answers":  [
                                                "6x = 2(x + 4)",
                                                "6x = 3(x + 4)",
                                                "6x = 2(x – 4)",
                                                "6x = 3(x – 4)"
                                            ],
                                "question":  "Турист изкачва връх за 6 чàса със скорост xkm/h и се връща обратно за 3 пъти по-малко време, като се движи с 4 km/h по-бързо. Уравнението, което изразява тази зависимост, е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Сумата на Мария става (x – 5), а при Иван остават (35 – x). Уравнението е x – 5 = 35 – x, откъдето 2x = 40 и x = 20 лв.",
                                "answers":  [
                                                "5 лв.",
                                                "10 лв.",
                                                "15 лв.",
                                                "20 лв."
                                            ],
                                "question":  "Иван имал 35 лв. и дал на сестра си Мария x лв. След като получила сумата и изхарчила 5 лв. от тях, Мария имала сума, равна на останалата при Иван. Сумата x е:",
                                "correctAnswerKey":  "answer_4"
                            },
                            {
                                "explanation":  "Превръщаме километрите в сантиметри: 40 km = 4 000 000 cm. Мащабът е 8 : 4 000 000, което след съкращаване е 1 : 500 000.",
                                "answers":  [
                                                "1 : 5",
                                                "1 : 5 000",
                                                "1 : 500 000",
                                                "1 : 5 000 000"
                                            ],
                                "question":  "Действителното разстояние между два града е 40 km. Ако на географска карта разстоянието между тях е 8 cm, то мащабът на картата е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Филип е написал 6/10 от книгата. Хонорарът му е (6/10) * 12 000 = 7 200 лв.",
                                "answers":  [
                                                "4 800 лв.",
                                                "6 000 лв.",
                                                "7 200 лв.",
                                                "8 400 лв."
                                            ],
                                "question":  "Филип и Дора пишат книга от 10 части. Филип написал 6 от тях, а Дора – останалите. Колко лева ще получи Филип, ако общият хонорар от 12 000 лв. се разпределя пропорционално на написаните части?",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Използваме уравнение за маслеността: 2.x + 3.3 = 5.3,6. Получаваме 2x + 9 = 18, откъдето 2x = 9 и x = 4,5%.",
                                "answers":  [
                                                "4%",
                                                "4,5%",
                                                "6%",
                                                "6,4%"
                                            ],
                                "question":  "Колко процента е маслеността на мляко, ако при смесването на 2 литра от него с 3 литра мляко с 3% масленост се получават 5 литра мляко с 3,6% масленост?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Времето на чирака за 60 чаши е 60 + 25% от 60 = 75 мин. За 60 мин той ще направи (60 / 75) * 60 = 48 чаши.",
                                "answers":  [
                                                "45",
                                                "48",
                                                "50",
                                                "75"
                                            ],
                                "question":  "Майстор изработва 60 чаши за 1 час. Чиракът се нуждае от 25% повече време за същия брой чаши. Колко чаши изработва чиракът за 1 час?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Общиятбройчастие 1 + 2 + 5 = 8. Едначасте 100 / 8 = 12,5 ml. Съставката Y е 2 части: 2 * 12,5 = 25 ml.",
                                "answers":  [
                                                "12,5 ml",
                                                "20 ml",
                                                "25 ml",
                                                "50 ml"
                                            ],
                                "question":  "При производство на козметично изделие се смесват съставки X, Y и Z в отношение 1 : 2 : 5. Колко милилитра е съдържанието на Y в 100 ml от изделието?",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Общият брой точки от 4 теста е 4 * 23,75 = 95. За среден успех 25 от 5 теста са нужни 5 * 25 = 125 точки. Разликата е 125 – 95 = 30 точки.",
                                "answers":  [
                                                "25",
                                                "30",
                                                "35",
                                                "40"
                                            ],
                                "question":  "Средният успех на ученик от четири теста е 23,75 точки. Колко точки трябва да получи на петия тест, за да стане средният му успех 25 точки?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Лицето на стената е 5 * 6 = 30 кв. м. Нужното количество боя е 30 * 200 g = 6000 g = 6 kg.",
                                "answers":  [
                                                "0,6 kg",
                                                "6 kg",
                                                "60 kg",
                                                "600 kg"
                                            ],
                                "question":  "За боядисване на 1 кв. метър стена се използват 200 грама боя. Колко килограма боя са нужни за стена с размери 5 m и 6 m?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "За 1 минутатяизминава 20 / 10 = 2%. За 45 минути ще измине 45 * 2 = 90%.",
                                "answers":  [
                                                "45%",
                                                "75%",
                                                "80%",
                                                "90%"
                                            ],
                                "question":  "Ивет изминава 20% от определен маршрут за 10 минути. Какъв процент от маршрута ще измине за 45 минути, ако се движи със същата скорост?",
                                "correctAnswerKey":  "answer_4"
                            }
                        ]
          },
    "10":  {
               "main":  [
                            {
                                "explanation":  "В думата „УЧЕБНИК“ има общо 7 букви. Гласните звукове са три – У, Е, И. По формулата за класическа вероятност P = 3/7.",
                                "answers":  [
                                                "3/7",
                                                "4/7",
                                                "6/7",
                                                "1"
                                            ],
                                "question":  "На всяко едно от седем еднакви картончета е записана по една от седемте букви на думата УЧЕБНИК. Каква е вероятността върху произволно изтеглено картонче да е записана буква, означаваща гласен звук?",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Простите числа върху стените на зара са 2, 3 и 5 (общо 3). Всички възможни изходи са 6. Вероятността е 3/6 = 1/2.",
                                "answers":  [
                                                "0",
                                                "1/3",
                                                "1/2",
                                                "2/3"
                                            ],
                                "question":  "Вероятността при хвърляне на стандартен зар да се падне просто число, е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Зелените моливи са 3 * 2 = 6, а общият брой моливи е 3 + 6 = 9. Благоприятните изходи са 3, следователно вероятността е 3/9 = 1/3.",
                                "answers":  [
                                                "1/3",
                                                "2/5",
                                                "3/5",
                                                "2/3"
                                            ],
                                "question":  "В кутия има 3 червени молива и два пъти повече зелени. Вероятността произволно изваден молив да е червен, е:",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Градусната мярка на спортния сектор е 360° – (150° + 80° + 90°) = 40°. Тъй като 360° съответстват на 90 минути, то 40° съответстват на (40/360) * 90 = 10 минути.",
                                "answers":  [
                                                "10 min",
                                                "15 min",
                                                "20 min",
                                                "40 min"
                                            ],
                                "question":  "Училищно тържество продължава 90 минути. По данните от кръговата диаграма секторите са: музикални (150°), театрални (80°), танцови (90°) и спортни. Колко минути продължават спортните изпълнения?",
                                "correctAnswerKey":  "answer_1"
                            },
                            {
                                "explanation":  "Съставяме уравнението: 50 + 4k + 5k + k = 200, което дава 10k = 150. Оттук k = 15.",
                                "answers":  [
                                                "5",
                                                "10",
                                                "15",
                                                "20"
                                            ],
                                "question":  "Социологическа агенция проучва любим сезон сред 200 човека. Данните са: Зима (50 души), Пролет (4k), Лято (5k) и Есен (k). Стойността на k е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Общият брой точки от първите 4 теста е 4 * 23,75 = 95. За среден успех 25 от 5 теста е необходим сбор 5 * 25 = 125. Разликата е 125 – 95 = 30 точки.",
                                "answers":  [
                                                "25",
                                                "30",
                                                "35",
                                                "40"
                                            ],
                                "question":  "Средният успех на ученик от четири теста е 23,75 точки. Колко точки трябва да получи на петия тест, за да стане средният му успех от петте теста точно 25 точки?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Превръщаме 40 km в сантиметри: 40 km = 4 000 000 cm. Мащабът е 8 : 4 000 000 = 1 : 500 000.",
                                "answers":  [
                                                "1 : 5",
                                                "1 : 5 000",
                                                "1 : 500 000",
                                                "1 : 5 000 000"
                                            ],
                                "question":  "Действителното разстояние между два града е 40 km. Ако на карта разстоянието е 8 cm, то мащабът на картата е:",
                                "correctAnswerKey":  "answer_3"
                            },
                            {
                                "explanation":  "Прилагаме формулата (a – b)² = a² – 2ab + b²: (2x)² – 2.2x.3 + 3² = 4x² – 12x + 9.",
                                "answers":  [
                                                "4x² – 9",
                                                "4x² – 12x + 9",
                                                "4x² + 12x + 9",
                                                "4x² – 6x + 9"
                                            ],
                                "question":  "Нормалният вид на израза (2x – 3)² е:",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "Лицетонастенатае 5 * 6 = 30 m². Нужнотоколичествобояе 30 * 200 g = 6000 g, коетоеточно 6 kg.",
                                "answers":  [
                                                "0,6 kg",
                                                "6 kg",
                                                "60 kg",
                                                "600 kg"
                                            ],
                                "question":  "За боядисване на 1 m² стена са нужни 200 g боя. Колко kg боя са необходими за стена с размери 5 m и 6 m?",
                                "correctAnswerKey":  "answer_2"
                            },
                            {
                                "explanation":  "∠A = 60°. Понеже M е от симетралата на AC, MA = MC. ΔAMC е равнобедрен с ъгъл 60°, т.е. равностранен, и MC = AC = 4 cm.",
                                "answers":  [
                                                "8 cm",
                                                "6 cm",
                                                "4 cm",
                                                "2 cm"
                                            ],
                                "question":  "В правоъгълния ΔABC (∠C = 90°) ∠B = 30° и AC = 4 cm. Симетралата на AC пресича хипотенузата AB в точка M. Дължината на CM е:",
                                "correctAnswerKey":  "answer_3"
                            }
                        ],
               "extra":  [
                             {
                                 "explanation":  "В думата „УЧЕБНИК“ има общо 7 букви. Гласните звукове са три – У, Е, И. По формулата за класическа вероятност благоприятните изходи са 3, а всички възможни са 7, следователно P = 3/7.",
                                 "answers":  [
                                                 "3/7",
                                                 "4/7",
                                                 "6/7",
                                                 "1"
                                             ],
                                 "question":  "На всяко едно от седем еднакви картончета е записана по една от седемте букви на думата УЧЕБНИК. Каква е вероятността върху произволно изтеглено картонче да е записана буква, означаваща гласен звук?",
                                 "correctAnswerKey":  "answer_1"
                             },
                             {
                                 "explanation":  "Простите числа върху стените на зара са 2, 3 и 5 (общо 3 благоприятни изхода). Всички възможни изходи са 6. Вероятността е 3/6 = 1/2.",
                                 "answers":  [
                                                 "0",
                                                 "1/3",
                                                 "1/2",
                                                 "2/3"
                                             ],
                                 "question":  "Вероятността при хвърляне на стандартен зар да се падне просто число, е:",
                                 "correctAnswerKey":  "answer_3"
                             },
                             {
                                 "explanation":  "Зеленитемоливиса 3 * 2 = 6. Общиятброймоливие 3 + 6 = 9. Благоприятнитеизходи (червенимоливи) са 3. Вероятносттае 3/9 = 1/3.",
                                 "answers":  [
                                                 "1/3",
                                                 "2/5",
                                                 "3/5",
                                                 "2/3"
                                             ],
                                 "question":  "В кутия има 3 червени молива и два пъти повече зелени. Вероятността произволно изваден молив да е червен, е:",
                                 "correctAnswerKey":  "answer_1"
                             },
                             {
                                 "explanation":  "Градусната мярка на спортния сектор е 360° – (150° + 80° + 90°) = 40°. Тъй като цялата диаграма (360°) съответства на 90 минути, то 40° съответстват на (40/360) * 90 = 10 минути.",
                                 "answers":  [
                                                 "10 min",
                                                 "15 min",
                                                 "20 min",
                                                 "40 min"
                                             ],
                                 "question":  "Училищнотържествопродължава 90 минути. Поданнитеоткръговатадиаграмасекторитеса: музикални (150°), театрални (80°), танцови (90°) испортни. Колкоминутипродължаватспортнитеизпълнения?",
                                 "correctAnswerKey":  "answer_1"
                             },
                             {
                                 "explanation":  "Съставяме уравнението въз основа на общия брой анкетирани: 50 + 4k + 5k + k = 200. Това води до 10k = 150, откъдето k = 15.",
                                 "answers":  [
                                                 "5",
                                                 "10",
                                                 "15",
                                                 "20"
                                             ],
                                 "question":  "Социологическа агенция проучва любим сезон сред 200 човека. Данните са: Зима (50 души), Пролет (4k), Лято (5k) и Есен (k). Стойността на k е:",
                                 "correctAnswerKey":  "answer_3"
                             },
                             {
                                 "explanation":  "Общият сбор точки от първите 4 теста е 4 * 23,75 = 95. За среден успех 25 от 5 теста е необходим общ сбор 5 * 25 = 125. Разликата е 125 – 95 = 30 точки.",
                                 "answers":  [
                                                 "25",
                                                 "30",
                                                 "35",
                                                 "40"
                                             ],
                                 "question":  "Средният успех на ученик от четири теста е 23,75 точки. Колко точки трябва да получи на петия тест, за да стане средният му успех от петте теста точно 25 точки?",
                                 "correctAnswerKey":  "answer_2"
                             },
                             {
                                 "explanation":  "Превръщаме 40 km в сантиметри: 40 km = 4 000 000 cm. Мащабът е отношението на разстоянието върху картата към действителното: 8 : 4 000 000 = 1 : 500 000.",
                                 "answers":  [
                                                 "1 : 5",
                                                 "1 : 5 000",
                                                 "1 : 500 000",
                                                 "1 : 5 000 000"
                                             ],
                                 "question":  "Действителното разстояние между два града е 40 km. Ако на карта разстоянието е 8 cm, то мащабът на картата е:",
                                 "correctAnswerKey":  "answer_3"
                             },
                             {
                                 "explanation":  "Прилагаме формулата за квадрат на разлика (a – b)² = a² – 2ab + b²: (2x)² – 2.2x.3 + 3² = 4x² – 12x + 9.",
                                 "answers":  [
                                                 "4x² – 9",
                                                 "4x² – 12x + 9",
                                                 "4x² + 12x + 9",
                                                 "4x² – 6x + 9"
                                             ],
                                 "question":  "Нормалният вид на израза (2x – 3)² е:",
                                 "correctAnswerKey":  "answer_2"
                             },
                             {
                                 "explanation":  "Лицето на правоъгълната стена е 5 * 6 = 30 m². Нужното количество боя е 30 * 200 g = 6000 g. Тъй като 1000 g = 1 kg, резултатът е 6 kg.",
                                 "answers":  [
                                                 "0,6 kg",
                                                 "6 kg",
                                                 "60 kg",
                                                 "600 kg"
                                             ],
                                 "question":  "За боядисване на 1 m² стена са нужни 200 g боя. Колко kg боя са необходими за стена с размери 5 m и 6 m?",
                                 "correctAnswerKey":  "answer_2"
                             },
                             {
                                 "explanation":  "ВΔABC ∠A = 180° - (90° + 30°) = 60°. Понеже M лежинасиметралатана AC, то MA = MC иΔAMC еравнобедренсъгъл 60°, коетогоправиравностранен. Следователно CM = AC = 4 cm.",
                                 "answers":  [
                                                 "8 cm",
                                                 "6 cm",
                                                 "4 cm",
                                                 "2 cm"
                                             ],
                                 "question":  "В правоъгълния ΔABC (∠C = 90°) ∠B = 30° и AC = 4 cm. Симетралата на AC пресича хипотенузата AB в точка M. Дължината на CM е:",
                                 "correctAnswerKey":  "answer_3"
                             }
                         ]
           }
};